[
    {
      "id": 1,
      "titleAr": "إنما الأعمال بالنيات",
      "titleFr": "Les actes ne valent que par leurs intentions",
      "titleEn": "Actions are by intentions",
      "narratorAr": "عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه",
      "narratorFr": "Selon Omar Ibn Al-Khattab, qu'Allah l'agrée",
      "narratorEn": "Narrated by Omar Ibn Al-Khattab (may Allah be pleased with him)",
      "textAr": "سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ",
      "textFr": "J'ai entendu le Messager d'Allah (ﷺ) dire: Les actes ne valent que par leurs intentions. Chacun n'a pour lui que ce qu'il a eu l'intention de faire. Celui qui a émigré vers Allah et Son messager, son émigration est pour Allah et Son messager. Celui qui a émigré pour obtenir un bien de ce monde ou pour épouser une femme, son émigration ne vaut que pour ce vers quoi il a émigré",
      "textEn": "I heard Allah's Messenger (ﷺ) saying: Actions are but by intentions and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for",
      "explanationAr": "هذا الحديث أصل عظيم من أصول الدين، وقاعدة مهمة من قواعد الأحكام. وهو أحد الأحاديث التي عليها مدار الإسلام. يبين هذا الحديث أن صحة الأعمال وقبولها متوقف على النية الصالحة، وأن الإنسان يجازى على عمله حسب نيته",
      "explanationFr": "Ce hadith est l'un des fondements majeurs de la religion et une règle importante parmi les règles juridiques. C'est l'un des hadiths sur lesquels repose l'Islam. Il montre que la validité et l'acceptation des actes dépendent de la bonne intention, et que l'homme est récompensé pour ses actes selon son intention",
      "explanationEn": "This hadith is one of the great foundations of Islam and an important principle of Islamic jurisprudence. It is one of the hadiths upon which Islam is based. It shows that the validity and acceptance of deeds depend on the good intention, and that a person is rewarded for their actions according to their intention",
      "sourceAr": "رواه إماما المحدثين: أبو عبد الله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بردزبه البخاري، وأبو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري في صحيحيهما اللذين هما أصح الكتب المصنفة",
      "sourceFr": "Rapporté par les deux imams des traditionnistes: Abou Abdullah Muhammad ibn Ismail al-Bukhari et Abou al-Hussein Muslim ibn al-Hajjaj al-Qushayri an-Naysaburi dans leurs deux Sahih qui sont les livres les plus authentiques compilés",
      "sourceEn": "Reported by the two imams of hadith: Abu Abdullah Muhammad ibn Ismail al-Bukhari and Abu al-Hussein Muslim ibn al-Hajjaj al-Qushayri an-Naysaburi in their two Sahih collections which are the most authentic compiled books"
    },
    {
        "id": 2,
        "titleAr": "حديث جبريل في أركان الإسلام",
        "titleFr": "Le hadith de Gabriel sur les piliers de l'Islam",
        "titleEn": "The hadith of Gabriel about the pillars of Islam",
        "narratorAr": "عن عمر بن الخطاب رضي الله عنه قال",
        "narratorFr": "D'après Omar Ibn Al-Khattab (qu'Allah l'agrée) qui a dit",
        "narratorEn": "Narrated by Omar Ibn Al-Khattab (may Allah be pleased with him) who said",
        "textAr": "بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعَرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ، حَتَّى جَلَسَ إلَى النَّبِيِّ صلى الله عليه وسلم، فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنْ الْإِسْلَامِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إنْ اسْتَطَعْت إلَيْهِ سَبِيلًا. قَالَ: صَدَقْت...",
        "textFr": "Alors que nous étions assis auprès du Messager d'Allah (ﷺ) un jour, voici que se présenta à nous un homme aux habits d'une blancheur éclatante, aux cheveux d'une noirceur intense, ne portant aucune trace de voyage, et personne parmi nous ne le connaissait. Il s'assit auprès du Prophète (ﷺ), plaça ses genoux contre les siens, posa ses paumes sur ses cuisses et dit : 'Ô Muhammad! Informe-moi au sujet de l'Islam.' Le Messager d'Allah (ﷺ) répondit : 'L'Islam consiste à ce que tu témoignes qu'il n'y a de divinité qu'Allah et que Muhammad est le Messager d'Allah, que tu accomplisses la prière, que tu verses la Zakat, que tu jeûnes le mois de Ramadan et que tu effectues le pèlerinage à la Maison si tu en as la capacité.' Il dit : 'Tu as dit vrai...'",
        "textEn": "One day while we were sitting with the Messenger of Allah (ﷺ), there appeared before us a man dressed in extremely white clothes and with very black hair, having no traces of journeying and none of us knew him. He sat down close by the Prophet (ﷺ), resting his knees against his knees and placing his palms on his thighs, and said: 'O Muhammad! Inform me about Islam.' The Messenger of Allah (ﷺ) replied: 'Islam is that you should testify that there is no deity except Allah and that Muhammad is His Messenger, perform the prayer, pay the Zakat, fast during Ramadan, and perform the pilgrimage to the House if you are able to do so.' The man said: 'You have spoken truthfully...'",
        "explanationAr": "هذا الحديث يُعرف بحديث جبريل، وهو من أعظم الأحاديث وأجمعها لأصول الدين. فيه بيان أركان الإسلام والإيمان والإحسان، وهي تمثل مراتب الدين الثلاث. وفيه أن جبريل عليه السلام جاء في صورة رجل ليعلم الناس دينهم بطريقة عملية من خلال السؤال والجواب",
        "explanationFr": "Ce hadith est connu comme le hadith de Gabriel, et c'est l'un des plus grands et des plus complets hadiths concernant les fondements de la religion. Il explique les piliers de l'Islam, de la foi et de la bienfaisance, qui représentent les trois niveaux de la religion. Il montre comment Gabriel (paix sur lui) est venu sous forme humaine pour enseigner aux gens leur religion de manière pratique à travers des questions et des réponses",
        "explanationEn": "This hadith is known as the hadith of Gabriel, and it is one of the greatest and most comprehensive hadiths regarding the foundations of religion. It explains the pillars of Islam, faith, and excellence (Ihsan), which represent the three levels of religion. It shows how Gabriel (peace be upon him) came in human form to teach people their religion in a practical way through questions and answers",
        "sourceAr": "رواه مسلم في صحيحه. وهو حديث متفق على صحته وعظيم أهميته في بيان أصول الدين وقواعده",
        "sourceFr": "Rapporté par Muslim dans son Sahih. C'est un hadith dont l'authenticité et la grande importance dans l'explication des fondements et des règles de la religion font l'unanimité",
        "sourceEn": "Reported by Muslim in his Sahih. This is a hadith whose authenticity and great importance in explaining the foundations and rules of religion are unanimously agreed upon"
      },
      {
        "id": 3,
        "titleAr": "أركان الإسلام الخمسة",
        "titleFr": "Les cinq piliers de l'Islam",
        "titleEn": "The Five Pillars of Islam",
        "narratorAr": "عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما قال",
        "narratorFr": "D'après Abu Abdurrahman Abdullah Ibn Omar Ibn Al-Khattab (qu'Allah les agrée tous deux) qui a dit",
        "narratorEn": "Narrated by Abu Abdurrahman Abdullah Ibn Omar Ibn Al-Khattab (may Allah be pleased with them both) who said",
        "textAr": "سمعت رسول الله صلى الله عليه وسلم يقول: بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ",
        "textFr": "J'ai entendu le Messager d'Allah (ﷺ) dire : L'Islam est bâti sur cinq piliers : L'attestation qu'il n'y a pas de divinité digne d'être adorée excepté Allah et que Muhammad est le Messager d'Allah, l'accomplissement de la prière, l'acquittement de la Zakat, le pèlerinage à la Maison Sacrée, et le jeûne du Ramadan",
        "textEn": "I heard the Messenger of Allah (ﷺ) saying: Islam is built upon five pillars: testifying that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, establishing the prayer, paying the Zakat, performing the pilgrimage to the House, and fasting in Ramadan",
        "explanationAr": "هذا الحديث العظيم يبين أركان الإسلام الخمسة التي هي أساس الدين وقواعده. شبه النبي صلى الله عليه وسلم الإسلام بالبناء المحكم القائم على خمس دعائم، وهي الشهادتان والصلاة والزكاة والحج وصوم رمضان. وهذه الأركان هي الأعمال الظاهرة التي يقوم عليها الإسلام",
        "explanationFr": "Ce noble hadith explique les cinq piliers de l'Islam qui sont le fondement et les règles de la religion. Le Prophète (ﷺ) a comparé l'Islam à un édifice solide reposant sur cinq piliers : les deux témoignages, la prière, la Zakat, le pèlerinage et le jeûne du Ramadan. Ces piliers représentent les actes apparents sur lesquels l'Islam est bâti",
        "explanationEn": "This noble hadith explains the five pillars of Islam which are the foundation and rules of the religion. The Prophet (ﷺ) compared Islam to a solid building standing on five pillars: the two testimonies, prayer, Zakat, pilgrimage, and fasting Ramadan. These pillars represent the outward acts upon which Islam is built",
        "sourceAr": "رواه البخاري ومسلم في صحيحيهما. وهو من الأحاديث المتفق عليها التي تبين أسس الإسلام وأركانه الأساسية",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim dans leurs Sahih. C'est l'un des hadiths unanimement reconnus qui expliquent les fondements de l'Islam et ses piliers essentiels",
        "sourceEn": "Reported by Al-Bukhari and Muslim in their Sahih collections. This is one of the unanimously accepted hadiths that explain the foundations of Islam and its essential pillars"
      },
      {
        "id": 4,
        "titleAr": "مراحل خلق الإنسان وكتابة قدره",
        "titleFr": "Les étapes de la création de l'homme et l'écriture de son destin",
        "titleEn": "The Stages of Creation and Writing of Destiny",
        "narratorAr": "عن أبي عبد الرحمن عبد الله بن مسعود رضي الله عنه قال: حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق",
        "narratorFr": "D'après Abu Abdurrahman Abdullah Ibn Masud (qu'Allah l'agrée) qui a dit : Le Messager d'Allah (ﷺ), le véridique, celui dont la véracité est confirmée, nous a raconté",
        "narratorEn": "Narrated by Abu Abdurrahman Abdullah Ibn Masud (may Allah be pleased with him) who said: The Messenger of Allah (ﷺ), the truthful and trustworthy, told us",
        "textAr": "إن أحدكم يجمع خلقه في بطن أمه أربعين يوماً نطفةً، ثم يكون علقةً مثل ذلك، ثم يكون مضغةً مثل ذلك، ثم يرسل إليه الملك فينفخ فيه الروح، ويؤمر بأربع كلمات: بكتب رزقه، وأجله، وعمله، وشقي أو سعيد. فوالله الذي لا إله غيره إن أحدكم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها، وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل الجنة فيدخلها",
        "textFr": "La création de chacun de vous se rassemble dans le ventre de sa mère durant quarante jours sous forme de goutte de sperme, puis il devient une adhérence pendant une période similaire, puis il devient un morceau de chair pendant une période similaire. Ensuite l'ange lui est envoyé et il insuffle en lui l'âme. Il est chargé d'écrire quatre choses : sa subsistance, son terme, ses œuvres, et s'il sera malheureux ou heureux. Par Allah, en dehors de qui il n'y a pas de divinité, l'un d'entre vous accomplit les œuvres des gens du Paradis jusqu'à ce qu'il n'y ait entre lui et le Paradis que la distance d'une coudée, alors le décret le précède et il accomplit les œuvres des gens de l'Enfer et y entre. Et l'un d'entre vous accomplit les œuvres des gens de l'Enfer jusqu'à ce qu'il n'y ait entre lui et l'Enfer que la distance d'une coudée, alors le décret le précède et il accomplit les œuvres des gens du Paradis et y entre",
        "textEn": "The creation of each one of you is gathered in his mother's womb for forty days as a drop of fluid, then he becomes a clot for a similar period, then a morsel of flesh for a similar period. Then the angel is sent to him and breathes into him the soul, and he is commanded to record four things: his provision, his life span, his deeds, and whether he will be wretched or happy. By Allah, besides Whom there is no deity, one of you may do the deeds of the people of Paradise until there is only a cubit between him and it, then what is written overtakes him and he does the deeds of the people of the Fire and enters it. And one of you may do the deeds of the people of the Fire until there is only a cubit between him and it, then what is written overtakes him and he does the deeds of the people of Paradise and enters it",
        "explanationAr": "هذا الحديث العظيم يبين مراحل خلق الإنسان في بطن أمه، وكيفية نفخ الروح فيه، وكتابة قدره. ويوضح أن الله تعالى قد كتب مقادير الخلائق قبل خلقهم، وأن العبرة بالخواتيم. كما يبين أهمية العمل الصالح والثبات عليه حتى الممات، وأن الهداية بيد الله تعالى",
        "explanationFr": "Ce noble hadith explique les étapes de la création de l'homme dans le ventre de sa mère, comment l'âme lui est insufflée, et comment son destin est écrit. Il montre qu'Allah a écrit le destin de Ses créatures avant leur création, et que ce qui compte ce sont les fins. Il souligne également l'importance des bonnes œuvres et de leur maintien jusqu'à la mort, et que la guidance est entre les mains d'Allah",
        "explanationEn": "This noble hadith explains the stages of human creation in the mother's womb, how the soul is breathed into it, and how destiny is written. It shows that Allah has written the destinies of His creation before creating them, and that what matters are the endings. It also emphasizes the importance of good deeds and maintaining them until death, and that guidance is in Allah's hands",
        "sourceAr": "رواه البخاري ومسلم في صحيحيهما. وهو من الأحاديث المتفق على صحتها التي تبين عقيدة القدر وأطوار خلق الإنسان",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim dans leurs Sahih. C'est l'un des hadiths authentiques qui expliquent la croyance au destin et les étapes de la création de l'homme",
        "sourceEn": "Reported by Al-Bukhari and Muslim in their Sahih collections. This is one of the authentic hadiths that explain the belief in destiny and the stages of human creation"
      },
      {
        "id": 5,
        "titleAr": "رد البدع والمحدثات",
        "titleFr": "Le rejet des innovations en religion",
        "titleEn": "Rejection of Religious Innovations",
        "narratorAr": "عن أم المؤمنين أم عبد الله عائشة رضي الله عنها قالت",
        "narratorFr": "D'après la mère des croyants Oum Abdullah Aisha (qu'Allah l'agrée) qui a dit",
        "narratorEn": "Narrated by the Mother of the Believers Umm Abdullah Aisha (may Allah be pleased with her) who said",
        "textAr": "قال رسول الله صلى الله عليه وسلم: مَنْ أَحْدَثَ في أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ",
        "textFr": "Le Messager d'Allah (ﷺ) a dit : Quiconque introduit dans notre religion-ci ce qui n'en fait pas partie, cela est rejeté",
        "textEn": "The Messenger of Allah (ﷺ) said: Whoever introduces into this matter of ours something that is not from it, it will be rejected",
        "explanationAr": "هذا الحديث أصل عظيم من أصول الدين، وقاعدة من قواعد الإسلام. وهو نص صريح في رد كل البدع والمحدثات في الدين. والمقصود بالأمر هنا هو الدين، فكل عمل لا يوافق الشريعة فهو مردود على صاحبه. وفي رواية أخرى: 'من عمل عملاً ليس عليه أمرنا فهو رد'. وهذا الحديث يدل على أن كل عبادة لم يشرعها الله ورسوله فهي باطلة مردودة",
        "explanationFr": "Ce hadith est l'un des fondements majeurs de la religion et l'une des règles de l'Islam. C'est un texte explicite sur le rejet de toutes les innovations en religion. Ce qui est visé par 'cette affaire' ici est la religion, donc tout acte qui ne correspond pas à la législation est rejeté sur celui qui l'accomplit. Dans une autre version : 'Quiconque accomplit un acte sur lequel il n'y a pas notre ordre, cet acte est rejeté'. Ce hadith indique que tout acte d'adoration qu'Allah et Son messager n'ont pas légiféré est nul et rejeté",
        "explanationEn": "This hadith is one of the major foundations of religion and one of the rules of Islam. It is an explicit text on rejecting all religious innovations. What is meant by 'this matter' here is the religion, so any act that does not conform to the legislation is rejected for whoever does it. In another narration: 'Whoever does an act that is not in accordance with our matter will have it rejected'. This hadith indicates that any act of worship that Allah and His messenger have not legislated is invalid and rejected",
        "sourceAr": "رواه البخاري ومسلم في صحيحيهما. وفي رواية لمسلم: 'من عمل عملاً ليس عليه أمرنا فهو رد'. وهو من جوامع الكلم التي أوتيها النبي صلى الله عليه وسلم",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim dans leurs Sahih. Et dans une version de Muslim : 'Quiconque accomplit un acte sur lequel il n'y a pas notre ordre, cet acte est rejeté'. C'est l'une des paroles concises et riches de sens que le Prophète (ﷺ) a reçues",
        "sourceEn": "Reported by Al-Bukhari and Muslim in their Sahih collections. And in Muslim's version: 'Whoever does an act that is not in accordance with our matter will have it rejected'. This is one of the comprehensive statements that the Prophet (ﷺ) was given"
      },
      {
        "id": 6,
        "titleAr": "الحلال والحرام والشبهات",
        "titleFr": "Le licite, l'illicite et les affaires douteuses",
        "titleEn": "The Lawful, Unlawful and Doubtful Matters",
        "narratorAr": "عن أبي عبد الله النعمان بن بشير رضي الله عنهما قال",
        "narratorFr": "D'après Abu Abdullah An-Nu'man Ibn Bachir (qu'Allah les agrée tous deux) qui a dit",
        "narratorEn": "Narrated by Abu Abdullah An-Nu'man Ibn Bashir (may Allah be pleased with them both) who said",
        "textAr": "سمعت رسول الله صلى الله عليه وسلم يقول: إِنَّ الْحَلاَلَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لاَ يَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ، فَمَنِ اتَّقَى الشُّبُهَاتِ فَقَدِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلاَ وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلاَ وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلاَ وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلاَ وَهِيَ الْقَلْبُ",
        "textFr": "J'ai entendu le Messager d'Allah (ﷺ) dire : Certes le licite est clair et certes l'illicite est clair, et entre les deux il y a des choses douteuses que beaucoup de gens ne connaissent pas. Celui qui se préserve des choses douteuses préserve sa religion et son honneur, et celui qui tombe dans les choses douteuses tombe dans l'illicite, tel le berger qui fait paître son troupeau autour d'un enclos réservé et qui est sur le point d'y empiéter. Attention ! Chaque roi a un domaine réservé, et le domaine réservé d'Allah est Ses interdits. Attention ! Il y a dans le corps un morceau de chair, s'il est bon, tout le corps est bon, et s'il est corrompu, tout le corps est corrompu. Attention ! C'est le cœur",
        "textEn": "I heard the Messenger of Allah (ﷺ) saying: Verily, the lawful is clear and the unlawful is clear, and between them are doubtful matters about which many people do not know. Thus, whoever avoids doubtful matters clears himself in regard to his religion and his honor. But whoever falls into doubtful matters falls into that which is unlawful, like the shepherd who pastures around a sanctuary, all but grazing therein. Truly, every king has a sanctuary, and truly Allah's sanctuary is His prohibitions. Truly, in the body there is a morsel of flesh which, if it is sound, the whole body is sound, and if it is corrupted, the whole body is corrupted. Truly, it is the heart",
        "explanationAr": "هذا الحديث من أصول الإسلام وقواعد الأحكام. يبين فيه النبي صلى الله عليه وسلم ثلاث مراتب للأحكام: الحلال البين، والحرام البين، والشبهات بينهما. ويضرب مثلاً بالراعي حول الحمى لتوضيح خطورة الوقوع في الشبهات. ثم يختم ببيان أهمية القلب وأثره في صلاح الإنسان أو فساده. هذا الحديث يؤسس لمبدأ الورع في الدين والحذر من الشبهات",
        "explanationFr": "Ce hadith est l'un des fondements de l'Islam et des règles juridiques. Le Prophète (ﷺ) y explique trois catégories de jugements : le licite évident, l'illicite évident, et les choses douteuses entre les deux. Il donne l'exemple du berger près de l'enclos réservé pour illustrer le danger de tomber dans les choses douteuses. Puis il conclut en montrant l'importance du cœur et son effet sur la droiture ou la corruption de l'homme. Ce hadith établit le principe de la piété scrupuleuse en religion et la prudence vis-à-vis des choses douteuses",
        "explanationEn": "This hadith is one of the foundations of Islam and legal rules. The Prophet (ﷺ) explains three categories of rulings: the clearly lawful, the clearly unlawful, and the doubtful matters between them. He gives the example of the shepherd near the sanctuary to illustrate the danger of falling into doubtful matters. Then he concludes by showing the importance of the heart and its effect on the righteousness or corruption of a person. This hadith establishes the principle of religious scrupulousness and caution regarding doubtful matters",
        "sourceAr": "رواه البخاري ومسلم في صحيحيهما. وهو من الأحاديث المتفق على صحتها وعظيم أهميتها في بيان أصول الحلال والحرام والورع في الدين",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim dans leurs Sahih. C'est l'un des hadiths dont l'authenticité et la grande importance sont reconnues pour expliquer les fondements du licite et de l'illicite et la piété scrupuleuse en religion",
        "sourceEn": "Reported by Al-Bukhari and Muslim in their Sahih collections. This is one of the authenticated hadiths recognized for its great importance in explaining the foundations of lawful and unlawful matters and religious scrupulousness"
      },
      {
        "id": 7,
        "titleAr": "الدين النصيحة",
        "titleFr": "La religion est le bon conseil",
        "titleEn": "Religion is sincere advice",
        "narratorAr": "عن أبي رُقَيَّةَ تَمِيمِ بنِ أَوْسٍ الدَّارِيِّ رضي الله عنه أنَّ النبيَّ صلى الله عليه وسلم قال",
        "narratorFr": "D'après Abu Ruqayyah Tamim Ibn Aws Ad-Dari (qu'Allah l'agrée), le Prophète (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Ruqayyah Tamim Ibn Aws Ad-Dari (may Allah be pleased with him), the Prophet (ﷺ) said",
        "textAr": "الدِّينُ النَّصِيحَةُ. قُلْنَا: لِمَنْ؟ قَالَ: لِلَّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ",
        "textFr": "La religion, c'est le bon conseil. Nous avons dit : Pour qui ? Il répondit : Pour Allah, pour Son Livre, pour Son Messager, pour les dirigeants des musulmans et pour la masse des musulmans",
        "textEn": "Religion is sincere advice. We said: To whom? He said: To Allah, His Book, His Messenger, the leaders of the Muslims, and their common folk",
        "explanationAr": "يبين الحديث أن الدين كله قائم على النصح لله بعبادته والإخلاص له، والنصح لكتابه بتلاوته والعمل به، والنصح لرسوله باتباع سنته، والنصح لأئمة المسلمين ببيان الحق لهم، والنصح لعامة المسلمين بإرشادهم للخير",
        "explanationFr": "Ce hadith montre que la religion repose sur le conseil sincère envers Allah (par l'adoration et la sincérité), envers Son Livre (en le lisant et en l'appliquant), envers Son Messager (en suivant sa Sunna), envers les dirigeants musulmans (en leur conseillant le bien) et envers la masse des musulmans (en les orientant vers le bien)",
        "explanationEn": "This hadith emphasizes that religion is based on sincere advice: to Allah (through worship and sincerity), to His Book (by reading and applying it), to His Messenger (by following his Sunnah), to Muslim leaders (by guiding them to the truth), and to the general Muslims (by directing them to good)",
        "sourceAr": "رواه مسلم في صحيحه",
        "sourceFr": "Rapporté par Muslim dans son Sahih",
        "sourceEn": "Reported by Muslim in his Sahih"
      },
      {
        "id": 8,
        "titleAr": "أركان الإسلام والإيمان",
        "titleFr": "Les piliers de l'Islam et de la foi",
        "titleEn": "The Pillars of Islam and Faith",
        "narratorAr": "عن عبد الله بن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال",
        "narratorFr": "D'après Abdullah Ibn Umar (qu'Allah les agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abdullah Ibn Umar (may Allah be pleased with them), the Messenger of Allah (ﷺ) said",
        "textAr": "أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ وَيُقِيْمُوْا الصَّلاةَ وَيُؤْتُوا الزَّكَاةَ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءهَمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّ الإِسْلامِ وَحِسَابُهُمْ عَلَى اللهِ تَعَالَى",
        "textFr": "Il m’a été ordonné de combattre les gens jusqu'à ce qu'ils témoignent qu'il n'y a de divinité digne d'adoration qu'Allah et que Muhammad est le Messager d'Allah, qu'ils accomplissent la prière et qu'ils s'acquittent de la zakat. S'ils font cela, ils préservent de moi leur sang et leurs biens, sauf selon le droit de l'Islam, et leur compte sera rendu à Allah.",
        "textEn": "I have been commanded to fight the people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give zakat. If they do so, they will have protected their blood and wealth from me except by the right of Islam, and their reckoning is with Allah.",
        "explanationAr": "يوضح الحديث أن الإسلام يقوم على شهادة التوحيد، وإقامة الصلاة، وإيتاء الزكاة. كما يشير إلى أن العلاقة بين المسلمين وغيرهم تستند إلى هذه الأسس، وأن الحساب النهائي بيد الله.",
        "explanationFr": "Ce hadith souligne que l'Islam repose sur l'attestation de l'unicité d'Allah, la prière et la zakat. Il indique aussi que les relations entre les musulmans et les autres sont basées sur ces fondements, et que le jugement final appartient à Allah.",
        "explanationEn": "This hadith emphasizes that Islam is based on the testimony of faith, prayer, and zakat. It also indicates that relationships between Muslims and others are based on these principles, and that ultimate judgment rests with Allah.",
        "sourceAr": "رواه البخاري ومسلم",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim",
        "sourceEn": "Reported by Al-Bukhari and Muslim"
      },      
      {
        "id": 9,
        "titleAr": "ما نهيتكم عنه فاجتنبوه",
        "titleFr": "Ce que je vous ai interdit, évitez-le",
        "titleEn": "What I have forbidden you, avoid it",
        "narratorAr": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Abu Hurayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Hurayra (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلاَفُهُمْ عَلَى أَنْبِيَائِهِمْ",
        "textFr": "Ce que je vous ai interdit, évitez-le, et ce que je vous ai ordonné, accomplissez-le autant que vous le pouvez. Car ceux qui vous ont précédés ont été détruits par leur excès de questions et leurs désaccords avec leurs prophètes",
        "textEn": "What I have forbidden you, avoid it, and what I have commanded you, do as much of it as you are able. For those before you were destroyed due to their excessive questioning and their disagreements with their prophets",
        "explanationAr": "يدعو الحديث إلى الامتثال لأوامر النبي صلى الله عليه وسلم والاجتناب عن نواهيه دون تكلف في السؤال، لأن كثرة التساؤل والتشدد أضر بالأمم السابقة",
        "explanationFr": "Ce hadith encourage l'obéissance aux ordres du Prophète (ﷺ) et l'évitement de ce qu'il a interdit, sans tomber dans l'excès de questionnements qui ont causé la ruine des générations précédentes",
        "explanationEn": "This hadith emphasizes obedience to the Prophet’s (ﷺ) commands and avoidance of prohibitions without excessive questioning, as excessive inquiries harmed previous nations",
        "sourceAr": "رواه البخاري ومسلم",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim",
        "sourceEn": "Reported by Al-Bukhari and Muslim"
      },
      {
        "id": 10,
        "titleAr": "سبب إجابة الدعاء",
        "titleFr": "La raison de l'exaucement des invocations",
        "titleEn": "The reason for answered supplications",
        "narratorAr": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Abu Hurayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Hurayra (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "إِنَّ اللَّهَ طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّبًا، وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ، فَقَالَ: ﴿يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا﴾، وَقَالَ: ﴿يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ﴾، ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ، يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ: يَا رَبِّ يَا رَبِّ، وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وَغُذِيَ بِالْحَرَامِ، فَأَنَّى يُسْتَجَابُ لَهُ؟",
        "textFr": "Allah est pur et n’accepte que ce qui est pur. Allah a ordonné aux croyants ce qu'Il a ordonné aux messagers, Il a dit : « Ô Messagers ! Mangez des bonnes choses et faites de bonnes actions. » Et Il a dit : « Ô vous qui avez cru ! Mangez des bonnes choses que Nous vous avons attribuées. » Puis il évoqua un homme qui prolonge son voyage, échevelé et couvert de poussière, levant ses mains vers le ciel en disant : 'Ô Seigneur, ô Seigneur', alors que sa nourriture est illicite, sa boisson est illicite, ses vêtements sont illicites, et il a été nourri par l'illicite, comment pourrait-il être exaucé ?",
        "textEn": "Allah is pure and accepts only what is pure. He has commanded the believers what He commanded the messengers, saying: 'O Messengers! Eat from the good things and act righteously.' And He said: 'O you who have believed! Eat from the good things We have provided for you.' Then he mentioned a man on a long journey, disheveled and dusty, raising his hands to the sky, saying: 'O Lord, O Lord,' while his food is unlawful, his drink is unlawful, his clothing is unlawful, and he is nourished by what is unlawful. How can he be answered?",
        "explanationAr": "يبين الحديث أن الله لا يقبل إلا الطيب من الأعمال والطعام، وأن أكل الحرام يمنع إجابة الدعاء، حتى لو توفرت أسباب القبول الظاهرة.",
        "explanationFr": "Ce hadith enseigne qu'Allah n'accepte que ce qui est pur et que consommer l'illicite empêche l'exaucement des invocations, même si les conditions extérieures semblent réunies.",
        "explanationEn": "This hadith emphasizes that Allah only accepts what is pure and that consuming unlawful things prevents supplications from being answered, even if external conditions appear suitable.",
        "sourceAr": "رواه مسلم",
        "sourceFr": "Rapporté par Muslim",
        "sourceEn": "Reported by Muslim"
      },
      {
        "id": 11,
        "titleAr": "ترك ما يريبك",
        "titleFr": "Laisse ce qui te met en doute",
        "titleEn": "Leave what makes you doubt",
        "narratorAr": "عن الحسن بن علي رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Al-Hasan Ibn Ali (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Al-Hasan Ibn Ali (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "دَعْ مَا يَرِيبُكَ إِلَى مَا لاَ يَرِيبُكَ، فَإِنَّ الصِّدْقَ طُمَأْنِينَةٌ، وَالْكَذِبَ رِيبَةٌ",
        "textFr": "Laisse ce qui te met en doute pour ce qui ne te met pas en doute, car la vérité est une source de sérénité et le mensonge est une source d'incertitude.",
        "textEn": "Leave what makes you doubt for what does not make you doubt, for truth is tranquility, and falsehood is doubt.",
        "explanationAr": "الحديث يدعو إلى اجتناب الأمور المشبوهة والميل إلى الواضح والمطمئن، لأن الصدق يجلب راحة القلب، بينما الكذب يؤدي إلى القلق والاضطراب.",
        "explanationFr": "Ce hadith encourage à éviter les choses douteuses et à s'en tenir à ce qui est clair et rassurant, car la vérité apporte la sérénité alors que le mensonge entraîne le trouble.",
        "explanationEn": "This hadith urges avoiding doubtful matters and sticking to what is clear and reassuring, as truth brings peace while falsehood leads to distress.",
        "sourceAr": "رواه الترمذي والنسائي، وقال الترمذي حديث حسن صحيح",
        "sourceFr": "Rapporté par At-Tirmidhi et An-Nasa'i, et At-Tirmidhi l'a déclaré bon et authentique",
        "sourceEn": "Reported by At-Tirmidhi and An-Nasa'i, and At-Tirmidhi graded it as good and authentic"
      },
      {
        "id": 12,
        "titleAr": "من حسن إسلام المرء",
        "titleFr": "Parmi la perfection de l'Islam d'une personne",
        "titleEn": "From the excellence of a person’s Islam",
        "narratorAr": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Abu Hurayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Hurayra (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "مِنْ حُسْنِ إِسْلاَمِ الْمَرْءِ تَرْكُهُ مَا لاَ يَعْنِيهِ",
        "textFr": "Parmi la perfection de l'Islam d'une personne, il y a le fait qu'il délaisse ce qui ne le concerne pas.",
        "textEn": "From the excellence of a person’s Islam is that he leaves what does not concern him.",
        "explanationAr": "الحديث يحث المسلم على الابتعاد عن الأمور التي لا تعنيه، والتركيز على ما فيه فائدة لدينه ودنياه.",
        "explanationFr": "Ce hadith encourage le musulman à éviter ce qui ne le concerne pas et à se concentrer sur ce qui est bénéfique pour sa religion et sa vie.",
        "explanationEn": "This hadith advises Muslims to avoid matters that do not concern them and focus on what benefits their religion and life.",
        "sourceAr": "رواه الترمذي وابن ماجه، وقال الترمذي حديث حسن",
        "sourceFr": "Rapporté par At-Tirmidhi et Ibn Majah, et At-Tirmidhi l'a déclaré bon",
        "sourceEn": "Reported by At-Tirmidhi and Ibn Majah, and At-Tirmidhi graded it as good"
      },
      {
        "id": 13,
        "titleAr": "كمال الإيمان",
        "titleFr": "La perfection de la foi",
        "titleEn": "The perfection of faith",
        "narratorAr": "عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Anas Ibn Malik (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Anas Ibn Malik (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ",
        "textFr": "Aucun d'entre vous ne sera vraiment croyant tant qu'il n'aimera pas pour son frère ce qu'il aime pour lui-même.",
        "textEn": "None of you truly believes until he loves for his brother what he loves for himself.",
        "explanationAr": "يبين الحديث أن الإيمان لا يكتمل حتى يحب المسلم الخير لإخوانه كما يحبه لنفسه، وهذا يشمل جميع مجالات الحياة.",
        "explanationFr": "Ce hadith montre que la foi n'est complète que lorsque le musulman aime le bien pour son frère comme il l'aime pour lui-même, dans tous les aspects de la vie.",
        "explanationEn": "This hadith highlights that faith is not complete until a Muslim loves good for his brother as he loves it for himself, in all aspects of life.",
        "sourceAr": "رواه البخاري ومسلم",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim",
        "sourceEn": "Reported by Al-Bukhari and Muslim"
      },
      {
        "id": 14,
        "titleAr": "حرمة دم المسلم",
        "titleFr": "L'inviolabilité du sang du musulman",
        "titleEn": "The sanctity of a Muslim’s blood",
        "narratorAr": "عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Abdullah Ibn Mas'ud (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abdullah Ibn Mas'ud (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بِإِحْدَى ثَلاَثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ",
        "textFr": "Le sang d’un musulman n’est licite que dans trois cas : le fornicateur marié, la vie pour la vie, et celui qui quitte sa religion en se séparant de la communauté.",
        "textEn": "The blood of a Muslim is not lawful except in three cases: a married fornicator, a life for a life, and one who leaves his religion and separates from the community.",
        "explanationAr": "يبين الحديث الحالات التي يجوز فيها القصاص أو العقوبة في الإسلام، وفقًا لأحكام الشريعة.",
        "explanationFr": "Ce hadith clarifie les situations où la peine légale est appliquée en Islam, conformément à la loi islamique.",
        "explanationEn": "This hadith clarifies the cases where legal punishment is applied in Islam, according to Islamic law.",
        "sourceAr": "رواه البخاري ومسلم",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim",
        "sourceEn": "Reported by Al-Bukhari and Muslim"
      },
      {
        "id": 15,
        "titleAr": "آداب الحديث",
        "titleFr": "Les bonnes manières dans la parole",
        "titleEn": "The etiquette of speech",
        "narratorAr": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Abu Hurayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Hurayra (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ",
        "textFr": "Que celui qui croit en Allah et au Jour Dernier dise du bien ou se taise. Que celui qui croit en Allah et au Jour Dernier honore son voisin. Que celui qui croit en Allah et au Jour Dernier honore son invité.",
        "textEn": "Whoever believes in Allah and the Last Day should speak good or remain silent. Whoever believes in Allah and the Last Day should honor his neighbor. Whoever believes in Allah and the Last Day should honor his guest.",
        "explanationAr": "يحث الحديث على ضبط اللسان وعدم قول ما يؤذي الآخرين، كما يحث على حسن معاملة الجيران والضيوف.",
        "explanationFr": "Ce hadith enseigne la maîtrise de la parole et encourage la bienveillance envers les voisins et les invités.",
        "explanationEn": "This hadith teaches control over speech and encourages kindness towards neighbors and guests.",
        "sourceAr": "رواه البخاري ومسلم",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim",
        "sourceEn": "Reported by Al-Bukhari and Muslim"
      },
      {
        "id": 16,
        "titleAr": "النهي عن الغضب",
        "titleFr": "L'interdiction de la colère",
        "titleEn": "The prohibition of anger",
        "narratorAr": "عن أبي هريرة رضي الله عنه أن رجلاً قال للنبي صلى الله عليه وسلم: أوصني، قال: لا تغضب، فردد مرارًا، قال: لا تغضب",
        "narratorFr": "D'après Abu Hurayra (qu'Allah l'agrée), un homme a dit au Prophète (ﷺ) : Donne-moi un conseil. Il répondit : Ne te mets pas en colère. L'homme répéta plusieurs fois la question, et à chaque fois, il répondit : Ne te mets pas en colère.",
        "narratorEn": "Narrated by Abu Hurayra (may Allah be pleased with him), a man said to the Prophet (ﷺ), 'Give me advice.' He said, 'Do not get angry.' The man repeated the request several times, and each time he said, 'Do not get angry.'",
        "textAr": "لا تغضب",
        "textFr": "Ne te mets pas en colère.",
        "textEn": "Do not get angry.",
        "explanationAr": "يوجه الحديث المسلم إلى ضبط النفس والابتعاد عن الغضب، لما له من آثار سلبية على الفرد والمجتمع.",
        "explanationFr": "Ce hadith encourage le contrôle de soi et la maîtrise de la colère en raison de ses conséquences négatives sur l'individu et la société.",
        "explanationEn": "This hadith advises self-control and avoiding anger due to its harmful effects on individuals and society.",
        "sourceAr": "رواه البخاري",
        "sourceFr": "Rapporté par Al-Bukhari",
        "sourceEn": "Reported by Al-Bukhari"
      },
      {
        "id": 17,
        "titleAr": "الإحسان في كل شيء",
        "titleFr": "L'excellence dans toute chose",
        "titleEn": "Excellence in everything",
        "narratorAr": "عن أبي يعلى شداد بن أوس رضي الله عنه أن رسول الله صلى الله عليه وسلم قال",
        "narratorFr": "D'après Abu Ya'la Shaddad Ibn Aws (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Ya'la Shaddad Ibn Aws (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "إِنَّ اللَّهَ كَتَبَ الإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ",
        "textFr": "Allah a prescrit l'excellence en toute chose. Lorsque vous tuez, tuez avec excellence, et lorsque vous égorgez, égorgez avec excellence. Que l'un de vous aiguise bien sa lame et traite sa bête avec douceur.",
        "textEn": "Allah has decreed excellence in everything. When you kill, kill with excellence, and when you slaughter, slaughter with excellence. Let one of you sharpen his blade and ease the suffering of his slaughtered animal.",
        "explanationAr": "يدعو الحديث إلى الإحسان في جميع الأفعال، حتى في الأمور التي تبدو قاسية مثل الذبح، مما يعكس رحمة الإسلام.",
        "explanationFr": "Ce hadith enseigne l'excellence et la bienveillance dans toutes les actions, y compris celles qui peuvent sembler dures comme l'abattage, reflétant ainsi la miséricorde de l'Islam.",
        "explanationEn": "This hadith teaches excellence and kindness in all actions, even in seemingly harsh matters like slaughter, reflecting the mercy of Islam.",
        "sourceAr": "رواه مسلم",
        "sourceFr": "Rapporté par Muslim",
        "sourceEn": "Reported by Muslim"
      },
      {
        "id": 18,
        "titleAr": "التقوى وحسن الخلق",
        "titleFr": "La piété et la bonne moralité",
        "titleEn": "Piety and good character",
        "narratorAr": "عن أبي ذر جندب بن جنادة، وأبي عبد الرحمن معاذ بن جبل رضي الله عنهما عن النبي صلى الله عليه وسلم قال",
        "narratorFr": "D'après Abu Dharr Jundub Ibn Junadah et Abu Abdur-Rahman Mu'adh Ibn Jabal (qu'Allah les agrée), le Prophète (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Dharr Jundub Ibn Junadah and Abu Abdur-Rahman Mu'adh Ibn Jabal (may Allah be pleased with them), the Prophet (ﷺ) said",
        "textAr": "اتَّقِ اللَّهِ حَيْثُمَا كُنْتَ، وَأَتْبِعِ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ",
        "textFr": "Crains Allah où que tu sois, fais suivre une mauvaise action d'une bonne action qui l'effacera, et comporte-toi envers les gens avec un bon caractère.",
        "textEn": "Fear Allah wherever you are, follow up a bad deed with a good deed to erase it, and treat people with good character.",
        "explanationAr": "يوجه الحديث المسلم إلى التقوى في جميع الأحوال، والتوبة عند الخطأ، وحسن معاملة الناس.",
        "explanationFr": "Ce hadith exhorte le musulman à la piété en toute circonstance, à se repentir après une faute, et à bien se comporter avec les autres.",
        "explanationEn": "This hadith instructs Muslims to be pious in all situations, to repent after sinning, and to treat others with good manners.",
        "sourceAr": "رواه الترمذي وقال حديث حسن",
        "sourceFr": "Rapporté par At-Tirmidhi qui l'a jugé bon",
        "sourceEn": "Reported by At-Tirmidhi who classified it as good"
      },
      {
        "id": 19,
        "titleAr": "الإيمان بالقضاء والقدر",
        "titleFr": "La foi dans le destin",
        "titleEn": "Faith in destiny",
        "narratorAr": "عن عبد الله بن عباس رضي الله عنهما قال: كنت خلف النبي صلى الله عليه وسلم يوما فقال",
        "narratorFr": "D'après Abdullah Ibn Abbas (qu'Allah les agrée), j'étais un jour derrière le Prophète (ﷺ) lorsqu'il me dit",
        "narratorEn": "Narrated by Abdullah Ibn Abbas (may Allah be pleased with them), one day I was behind the Prophet (ﷺ) when he said",
        "textAr": "يَا غُلاَمُ، إِنِّي أُعَلِّمُكَ كَلِمَاتٍ: احْفَظِ اللَّهَ يَحْفَظْكَ، احْفَظِ اللَّهَ تَجِدْهُ تُجَاهَكَ، إِذَا سَأَلْتَ فَاسْأَلِ اللَّهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ، وَاعْلَمْ أَنَّ الأُمَّةَ لَوِ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَكَ، وَإِنِ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْكَ، رُفِعَتِ الأَقْلَامُ وَجَفَّتِ الصُّحُفُ",
        "textFr": "Ô jeune homme, je vais t'enseigner quelques paroles : Préserve Allah et Il te préservera, préserve Allah et tu Le trouveras devant toi. Lorsque tu demandes, demande à Allah, et lorsque tu cherches de l'aide, cherche l'aide d'Allah. Sache que si toute la nation se réunissait pour te bénéficier en quoi que ce soit, elle ne te profiterait que par ce qu'Allah a déjà écrit pour toi. Et si elle se réunissait pour te nuire en quoi que ce soit, elle ne te nuirait que par ce qu'Allah a déjà écrit contre toi. Les plumes ont été levées et l'encre s'est asséchée.",
        "textEn": "O young man, I shall teach you some words: Preserve Allah and He will preserve you. Preserve Allah and you will find Him before you. If you ask, ask Allah; if you seek help, seek help from Allah. Know that if the entire nation were to gather together to benefit you with something, they would not benefit you except with what Allah has already written for you. And if they gathered together to harm you with something, they would not harm you except with what Allah has already written against you. The pens have been lifted and the pages have dried.",
        "explanationAr": "يبين الحديث أهمية الإيمان بالقضاء والقدر، والاعتماد على الله في جميع الأمور، ويؤكد أن ما يصيب الإنسان مكتوب عند الله. كما يحث المسلم على التوكل على الله واللجوء إليه في كل حاجاته.",
        "explanationFr": "Ce hadith met en lumière l'importance de la foi dans le destin et de la confiance en Allah en toutes circonstances. Il rappelle que tout ce qui arrive est déjà écrit par Allah et exhorte à s'en remettre à Lui.",
        "explanationEn": "This hadith emphasizes the importance of faith in destiny and reliance on Allah in all matters. It highlights that everything that happens is already decreed by Allah and encourages believers to put their trust in Him.",
        "sourceAr": "رواه الترمذي وقال حديث حسن صحيح",
        "sourceFr": "Rapporté par At-Tirmidhi qui l'a jugé bon et authentique",
        "sourceEn": "Reported by At-Tirmidhi who classified it as good and authentic"
      },
      {
        "id": 20,
        "titleAr": "الحياء من الإيمان",
        "titleFr": "La pudeur fait partie de la foi",
        "titleEn": "Modesty is part of faith",
        "narratorAr": "عن أبي مسعود عقبة بن عمرو الأنصاري البدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Abu Mas'ud Uqba Ibn Amr Al-Ansari Al-Badri (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Mas'ud Uqba Ibn Amr Al-Ansari Al-Badri (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الأُولَى: إِذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ",
        "textFr": "Parmi ce que les gens ont retenu des paroles des premiers prophètes : 'Si tu n'as pas de pudeur, alors fais ce que tu veux'.",
        "textEn": "Among the words of the previous prophets that people have retained: 'If you feel no shame, then do as you wish'.",
        "explanationAr": "يوضح الحديث أهمية الحياء في الإسلام، فهو خلق محمود يمنع الإنسان من الوقوع في المعاصي. ومعنى الحديث ليس الأمر بالفعل، بل هو تحذير من التجرؤ على الأفعال القبيحة عند غياب الحياء.",
        "explanationFr": "Ce hadith met en évidence l'importance de la pudeur en Islam, car c'est une qualité louable qui empêche de commettre des péchés. L'expression ne signifie pas une permission, mais un avertissement contre le fait de s'engager dans des actions répréhensibles en l'absence de pudeur.",
        "explanationEn": "This hadith highlights the importance of modesty in Islam, as it is a praiseworthy trait that prevents a person from committing sins. The phrase does not indicate permission but serves as a warning against engaging in shameful acts when one lacks modesty.",
        "sourceAr": "رواه البخاري",
        "sourceFr": "Rapporté par Al-Bukhari",
        "sourceEn": "Reported by Al-Bukhari"
      },
      {
        "id": 21,
        "titleAr": "الاستقامة في الإيمان",
        "titleFr": "La droiture dans la foi",
        "titleEn": "Righteousness in faith",
        "narratorAr": "عن أبي عمرو، وقيل: أبي عمرة سفيان بن عبد الله الثقفي رضي الله عنه قال: قلتُ يا رسولَ الله، قُلْ لي في الإسلامِ قولًا لا أسألُ عنه أحدًا غيرَك",
        "narratorFr": "D'après Abu Amr, ou selon une autre version, Abu Amrah Sufyan Ibn Abdullah Ath-Thaqafi (qu'Allah l'agrée), j'ai dit : Ô Messager d'Allah, dis-moi une parole sur l'Islam que je ne demanderai à personne d'autre après toi",
        "narratorEn": "Narrated by Abu Amr, or as some say, Abu Amrah Sufyan Ibn Abdullah Ath-Thaqafi (may Allah be pleased with him), I said: O Messenger of Allah, tell me something about Islam that I will not need to ask anyone else after you",
        "textAr": "قُلْ: آمَنْتُ بِاللَّهِ ثُمَّ اسْتَقِمْ",
        "textFr": "Il a dit : 'Dis : Je crois en Allah, puis reste droit'.",
        "textEn": "He said: 'Say: I believe in Allah, then remain steadfast'.",
        "explanationAr": "يبين الحديث أهمية التوحيد والاستقامة في الدين، حيث أن الإيمان الحقيقي يستوجب الالتزام والثبات على طريق الحق، فالاستقامة تعني الثبات على الطاعة واجتناب المعاصي.",
        "explanationFr": "Ce hadith souligne l'importance du monothéisme et de la droiture dans la religion. La foi véritable implique un engagement et une constance dans l'obéissance à Allah et l'évitement des péchés.",
        "explanationEn": "This hadith emphasizes the importance of monotheism and steadfastness in religion. True faith requires commitment and consistency in obedience to Allah and avoidance of sins.",
        "sourceAr": "رواه مسلم",
        "sourceFr": "Rapporté par Muslim",
        "sourceEn": "Reported by Muslim"
      },
      {
        "id": 22,
        "titleAr": "سعة فضل الله",
        "titleFr": "L'immensité de la grâce d'Allah",
        "titleEn": "The vastness of Allah's grace",
        "narratorAr": "عن أبي عبد الله جابر بن عبد الله الأنصاري رضي الله عنهما أن رجلًا سأل رسول الله صلى الله عليه وسلم فقال: أرأيتَ إذا صلَّيتُ المكتوبات، وصُمتُ رمضان، وأحلَلتُ الحلال، وحرَّمتُ الحرام، ولم أزِدْ على ذلك شيئًا، أأدخلُ الجنة؟ قال: نعم",
        "narratorFr": "D'après Abu Abdullah Jabir Ibn Abdullah Al-Ansari (qu'Allah les agrée), un homme a demandé au Messager d'Allah (ﷺ) : 'Que dis-tu si j'accomplis les prières obligatoires, je jeûne Ramadan, je rends licite ce qui est licite et j'interdis ce qui est illicite, et que je n'ajoute rien d'autre à cela, entrerai-je au Paradis ?' Il répondit : 'Oui'.",
        "narratorEn": "Narrated by Abu Abdullah Jabir Ibn Abdullah Al-Ansari (may Allah be pleased with them), a man asked the Messenger of Allah (ﷺ): 'What do you say if I perform the obligatory prayers, fast during Ramadan, make lawful what is lawful, and forbid what is unlawful, and do nothing more than this, will I enter Paradise?' He replied: 'Yes'.",
        "textAr": "أرأيتَ إذا صلَّيتُ المكتوبات، وصُمتُ رمضان، وأحلَلتُ الحلال، وحرَّمتُ الحرام، ولم أزِدْ على ذلك شيئًا، أأدخلُ الجنة؟ قال: نعم",
        "textFr": "Que dis-tu si j'accomplis les prières obligatoires, je jeûne Ramadan, je rends licite ce qui est licite et j'interdis ce qui est illicite, et que je n'ajoute rien d'autre à cela, entrerai-je au Paradis ? Il répondit : 'Oui'.",
        "textEn": "What do you say if I perform the obligatory prayers, fast during Ramadan, make lawful what is lawful, and forbid what is unlawful, and do nothing more than this, will I enter Paradise? He replied: 'Yes'.",
        "explanationAr": "يبين الحديث سعة رحمة الله وفضله، وأن الالتزام بالفرائض واجتناب المحرمات سبب كافٍ لدخول الجنة، لكنه لا ينفي فضل الأعمال المستحبة التي ترفع الدرجات.",
        "explanationFr": "Ce hadith met en évidence l'immensité de la miséricorde d'Allah et Son immense grâce. Il montre que l'accomplissement des obligations religieuses et l'évitement des interdits suffisent pour entrer au Paradis, bien que les actes surérogatoires élèvent le statut du croyant.",
        "explanationEn": "This hadith highlights the vast mercy and grace of Allah. It demonstrates that fulfilling religious obligations and avoiding prohibitions are sufficient for entering Paradise, though voluntary deeds elevate one's status.",
        "sourceAr": "رواه مسلم",
        "sourceFr": "Rapporté par Muslim",
        "sourceEn": "Reported by Muslim"
      },
      {
        "id": 23,
        "titleAr": "الطهارة شرط لقبول الصلاة",
        "titleFr": "La pureté est une condition pour l’acceptation de la prière",
        "titleEn": "Purity is a condition for the acceptance of prayer",
        "narratorAr": "عن أبي مالك الحارث بن عاصم الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Abu Malik Al-Harith Ibn Asim Al-Ash'ari (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Malik Al-Harith Ibn Asim Al-Ash'ari (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "الطُّهُورُ شَطْرُ الإِيمَانِ، وَالْحَمْدُ لِلَّهِ تَمْلأُ الْمِيزَانَ، وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلآنِ - أَوْ تَمْلأُ - مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ، وَالصَّلَاةُ نُورٌ، وَالصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو فَبَائِعٌ نَفْسَهُ، فَمُعْتِقُهَا أَوْ مُوبِقُهَا",
        "textFr": "La pureté est la moitié de la foi, et 'Alhamdoulillah' (Louange à Allah) remplit la balance. 'Subhanallah' (Gloire à Allah) et 'Alhamdoulillah' remplissent ce qui est entre le ciel et la terre. La prière est une lumière, l’aumône est une preuve, la patience est une clarté, et le Coran est soit une preuve en ta faveur, soit contre toi. Chaque matin, l’homme se met en action : il vend son âme, la libérant ou la conduisant à sa perte.",
        "textEn": "Purification is half of faith. Saying 'Alhamdulillah' (Praise be to Allah) fills the scale. Saying 'SubhanAllah' (Glory be to Allah) and 'Alhamdulillah' fill what is between the heavens and the earth. Prayer is light, charity is proof, patience is illumination, and the Qur'an is either an argument for you or against you. Every morning, people go forth and sell their souls, either freeing them or bringing about their ruin.",
        "explanationAr": "يوضح الحديث أهمية الطهارة في الإسلام، حيث أنها جزء أساسي من الإيمان. كما يشير إلى فضل الذكر والتسبيح والصلاة والصدقة والصبر، وأن الإنسان هو من يحدد مصيره بنفسه من خلال أفعاله.",
        "explanationFr": "Ce hadith met en avant l'importance de la pureté en Islam, car elle constitue une partie essentielle de la foi. Il souligne également le mérite du rappel d’Allah, de la prière, de l’aumône et de la patience, et montre que chacun est responsable de son destin à travers ses actions.",
        "explanationEn": "This hadith highlights the importance of purification in Islam as an essential part of faith. It also emphasizes the virtue of remembrance, prayer, charity, and patience, showing that each person determines their own destiny through their actions.",
        "sourceAr": "رواه مسلم",
        "sourceFr": "Rapporté par Muslim",
        "sourceEn": "Reported by Muslim"
      },
      {
        "id": 24,
        "titleAr": "الحلال والحرام والطيب من الأمور",
        "titleFr": "Le licite, l’illicite et les bonnes choses",
        "titleEn": "The lawful, the unlawful, and good matters",
        "narratorAr": "عن أبي ذر الغفاري رضي الله عنه عن النبي صلى الله عليه وسلم فيما يرويه عن ربه عز وجل أنه قال",
        "narratorFr": "D'après Abu Dharr Al-Ghifari (qu'Allah l'agrée), le Prophète (ﷺ) rapporte de son Seigneur, Exalté soit-Il, qu'Il a dit",
        "narratorEn": "Narrated by Abu Dharr Al-Ghifari (may Allah be pleased with him), the Prophet (ﷺ) reported from his Lord, the Almighty, that He said",
        "textAr": "يا عبادي، إني حرمت الظلم على نفسي، وجعلته بينكم محرماً فلا تظالموا. يا عبادي، كلكم ضال إلا من هديته فاستهدوني أهدكم. يا عبادي، كلكم جائع إلا من أطعمته فاستطعموني أطعمكم. يا عبادي، كلكم عار إلا من كسوته فاستكسوني أكسكم. يا عبادي، إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعاً فاستغفروني أغفر لكم. يا عبادي، إنكم لن تبلغوا ضري فتضروني، ولن تبلغوا نفعي فتنفعوني...",
        "textFr": "Ô Mes serviteurs ! Je me suis interdit l'injustice et Je l'ai rendue interdite entre vous, ne soyez donc pas injustes les uns envers les autres. Ô Mes serviteurs ! Vous êtes tous égarés sauf celui que Je guide, demandez-Moi donc la guidance et Je vous guiderai. Ô Mes serviteurs ! Vous êtes tous affamés sauf celui que Je nourris, demandez-Moi donc à manger et Je vous nourrirai. Ô Mes serviteurs ! Vous êtes tous nus sauf celui que J’habille, demandez-Moi donc des vêtements et Je vous habillerai. Ô Mes serviteurs ! Vous péchez nuit et jour et c’est Moi qui pardonne tous les péchés, demandez-Moi donc pardon et Je vous pardonnerai...",
        "textEn": "O My servants, I have forbidden oppression upon Myself and have made it forbidden among you, so do not oppress one another. O My servants, all of you are astray except for those whom I have guided, so seek guidance from Me and I shall guide you. O My servants, all of you are hungry except for those whom I have fed, so seek food from Me and I shall feed you. O My servants, all of you are naked except for those whom I have clothed, so seek clothing from Me and I shall clothe you. O My servants, you commit sins by night and by day, and I forgive all sins, so seek forgiveness from Me and I shall forgive you...",
        "explanationAr": "هذا الحديث القدسي يعكس عظمة الله ورحمته بعباده، ويبين أهمية التوكل على الله في كل الأمور، كما يؤكد على أن الظلم محرم، وأن الله هو الرزاق والمغفر للذنوب.",
        "explanationFr": "Ce hadith Qudsi met en évidence la grandeur et la miséricorde d’Allah envers Ses serviteurs. Il rappelle l'importance de se confier à Allah en toute chose, que l’injustice est interdite et qu’Allah est le Pourvoyeur et Celui qui pardonne les péchés.",
        "explanationEn": "This Qudsi hadith reflects Allah’s greatness and mercy upon His servants. It emphasizes reliance on Allah in all matters, that oppression is forbidden, and that Allah is the Provider and the One who forgives sins.",
        "sourceAr": "رواه مسلم",
        "sourceFr": "Rapporté par Muslim",
        "sourceEn": "Reported by Muslim"
      },
      {
        "id": 25,
        "titleAr": "الصدقة بغير المال",
        "titleFr": "L'Aumône sans Argent",
        "titleEn": "Charity Without Wealth",
        "narratorAr": "عن أبي ذر رضي الله عنه قال",
        "narratorFr": "D'après Abu Dharr (qu'Allah l'agrée), il a dit",
        "narratorEn": "Narrated by Abu Dharr (may Allah be pleased with him), he said",
        "textAr": "أَنَّ أُنَاسَاً مِنْ أَصحَابِ رَسُولِ اللهِ ﷺ قَالوا للنَّبي ﷺ يَارَسُولَ الله: ذَهَبَ أَهلُ الدثورِ بِالأُجورِ، يُصَلُّوْنَ كَمَا نُصَلِّيْ، وَيَصُوْمُوْنَ كَمَا نَصُوْمُ، وَيَتَصَدَّقُوْنَ بفُضُوْلِ أَمْوَالِهِمْ، قَالَ: (أَوَ لَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَّدَّقُوْنَ؟ إِنَّ بِكُلِّ تَسْبِيْحَةٍ صَدَقَة.وَكُلِّ تَكْبِيْرَةٍ صَدَقَةً وَكُلِّ تَحْمَيْدَةٍ صَدَقَةً وَكُلِّ تَهْلِيْلَةٍ صَدَقَةٌ وَأَمْرٌ بالِمَعْرُوْفٍ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِيْ بُضْعِ أَحَدِكُمْ صَدَقَةٌ قَالُوا: يَا رَسُوْلَ اللهِ أَيَأْتِيْ أَحَدُنَا شَهْوَتَهُ وَيَكُوْنُ لَهُ فِيْهَا أَجْرٌ؟ قَالَ: أَرَأَيْتُمْ لَوْ وَضَعَهَا فَيْ حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إِذَا وَضَعَهَا فَي الحَلالِ كَانَ لَهُ أَجْرٌ)",
        "textFr": "Des compagnons du Messager d'Allah (ﷺ) dirent : \"Ô Messager d'Allah ! Les riches ont emporté les récompenses ! Ils prient comme nous prions, ils jeûnent comme nous jeûnons, et ils donnent en aumône avec le surplus de leur richesse.\" Il répondit : \"Allah ne vous a-t-Il pas donné de quoi faire l'aumône ? Chaque tasbih (dire 'SubhanAllah') est une aumône, chaque takbir (dire 'Allahu Akbar') est une aumône, chaque tahmid (dire 'Alhamdulillah') est une aumône, chaque tahlil (dire 'La ilaha illa Allah') est une aumône, ordonner le bien est une aumône, interdire le mal est une aumône, et même l’acte intime de l’un de vous est une aumône.\" Ils dirent : \"Ô Messager d'Allah ! L’un de nous assouvit son désir et il en reçoit une récompense ?\" Il dit : \"Ne voyez-vous pas que s’il l’avait fait dans l’interdit, il aurait un péché ? De même, s’il le fait dans le licite, il a une récompense.\"",
        "textEn": "Some companions of the Messenger of Allah (ﷺ) said: \"O Messenger of Allah! The wealthy have taken all the rewards! They pray as we pray, fast as we fast, and give in charity from the surplus of their wealth.\" He (ﷺ) said: \"Has not Allah given you ways to give charity? Every tasbih (saying 'SubhanAllah') is charity, every takbir (saying 'Allahu Akbar') is charity, every tahmid (saying 'Alhamdulillah') is charity, every tahlil (saying 'La ilaha illa Allah') is charity. Enjoining good is charity, forbidding evil is charity, and even in the sexual act of one of you there is charity.\" They asked: \"O Messenger of Allah! One of us fulfills his desire and he gets rewarded for it?\" He said: \"Do you not see that if he had placed it in the forbidden, he would have sinned? So, likewise, if he places it in the lawful, he will be rewarded.\"",
        "explanationAr": "يبين الحديث أن الصدقة لا تقتصر على المال فقط، بل تشمل الذكر، والأمر بالمعروف والنهي عن المنكر، وحتى العلاقات الزوجية إذا نُويت بها الطاعة. يوضح الحديث سعة فضل الله ورحمته بعباده.",
        "explanationFr": "Ce hadith montre que l'aumône ne se limite pas à l'argent, mais inclut le rappel d'Allah, l'encouragement au bien, l'interdiction du mal et même les relations conjugales si elles sont accomplies avec une bonne intention. Cela témoigne de la miséricorde d'Allah.",
        "explanationEn": "This hadith demonstrates that charity is not limited to monetary donations but includes remembrance of Allah, enjoining good, forbidding evil, and even marital relations if done with righteous intentions. It highlights Allah’s vast mercy.",
        "sourceAr": "رواه مسلم",
        "sourceFr": "Rapporté par Muslim",
        "sourceEn": "Reported by Muslim"
      },      
      {
        "id": 26,
        "titleAr": "الصدقة وأهميتها",
        "titleFr": "L'importance de l'aumône",
        "titleEn": "The Importance of Charity",
        "narratorAr": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم",
        "narratorFr": "D'après Abu Hurayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Hurayrah (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "كل سلامى من الناس عليه صدقة، كل يوم تطلع فيه الشمس: تعدل بين اثنين صدقة، وتعين الرجل في دابته فتحمله عليها أو ترفع له عليها متاعه صدقة، والكلمة الطيبة صدقة، وبكل خطوة تمشيها إلى الصلاة صدقة، وتميط الأذى عن الطريق صدقة",
        "textFr": "Chaque articulation du corps de l'homme doit une aumône chaque jour où le soleil se lève : réconcilier deux personnes est une aumône, aider un homme à monter sur sa monture ou à y placer ses bagages est une aumône, une bonne parole est une aumône, chaque pas vers la prière est une aumône, et enlever un obstacle du chemin est une aumône.",
        "textEn": "Every joint in a person’s body must perform a charity each day that the sun rises: reconciling two people is charity, helping a man onto his mount or lifting his belongings onto it is charity, a good word is charity, every step you take towards prayer is charity, and removing a harmful object from the road is charity.",
        "explanationAr": "يبين الحديث أن الصدقة لا تقتصر على المال، بل تشمل جميع الأعمال الصالحة التي تفيد الآخرين، مثل الإصلاح بين الناس، وإزالة الأذى من الطريق، والكلمة الطيبة.",
        "explanationFr": "Ce hadith montre que l'aumône ne se limite pas à l'argent, mais inclut toutes les bonnes actions qui bénéficient aux autres, comme réconcilier les gens, enlever les obstacles du chemin, et dire de bonnes paroles.",
        "explanationEn": "This hadith illustrates that charity is not limited to giving money but includes all good deeds that benefit others, such as reconciling people, removing harm from the road, and speaking good words.",
        "sourceAr": "رواه البخاري ومسلم",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim",
        "sourceEn": "Reported by Al-Bukhari and Muslim"
      },
      {
        "id": 27,
        "titleAr": "البر والإثم",
        "titleFr": "La piété et le péché",
        "titleEn": "Righteousness and Sin",
        "narratorAr": "عن النواس بن سمعان رضي الله عنه قال: سألت رسول الله صلى الله عليه وسلم عن البر والإثم، فقال",
        "narratorFr": "D'après An-Nawwas Ibn Sam'an (qu'Allah l'agrée), j'ai interrogé le Messager d'Allah (ﷺ) au sujet de la piété et du péché, et il a dit",
        "narratorEn": "Narrated by An-Nawwas Ibn Sam‘an (may Allah be pleased with him), I asked the Messenger of Allah (ﷺ) about righteousness and sin, and he said",
        "textAr": "البِرُّ حُسْنُ الْخُلُقِ، وَالإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ",
        "textFr": "La piété est la bonne moralité, et le péché est ce qui trouble ton cœur et que tu détestes que les gens découvrent.",
        "textEn": "Righteousness is good character, and sin is that which troubles your heart and you dislike that people find out about.",
        "explanationAr": "يوضح الحديث أن البر مرتبط بحسن الخلق، بينما الإثم هو كل ما يشعر الإنسان بعدم الارتياح تجاهه، خاصة إذا كره أن يطّلع عليه الآخرون.",
        "explanationFr": "Ce hadith montre que la piété est liée aux bonnes mœurs, alors que le péché est tout ce qui cause une gêne intérieure, particulièrement si l’on craint que les autres le découvrent.",
        "explanationEn": "This hadith explains that righteousness is linked to good character, while sin is anything that causes inner discomfort, especially if one dislikes others knowing about it.",
        "sourceAr": "رواه مسلم",
        "sourceFr": "Rapporté par Muslim",
        "sourceEn": "Reported by Muslim"
      },
      {
        "id": 28,
        "titleAr": "الوصية باتباع السنة",
        "titleFr": "La Recommandation de Suivre la Sunna",
        "titleEn": "The Advice to Follow the Sunnah",
        "narratorAr": "عن أبي نجيح العرباض بن سارية رضي الله عنه قال",
        "narratorFr": "D'après Abu Najih al-Irbad ibn Sariyah (qu'Allah l'agrée), il a dit",
        "narratorEn": "Narrated by Abu Najih al-Irbad ibn Sariyah (may Allah be pleased with him), he said",
        "textAr": "وَعَظَنا رَسُولُ اللهِ مَوعِظَةً وَجِلَت مِنهَا القُلُوبُ وَذَرَفَت مِنهَا العُيون. فَقُلْنَا: يَارَسُولَ اللهِ كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوصِنَا، قَالَ: (أُوْصِيْكُمْ بِتَقْوَى اللهِ عز وجل وَالسَّمعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلافَاً كَثِيرَاً؛ فَعَلَيكُمْ بِسُنَّتِيْ وَسُنَّةِ الخُلَفَاءِ الرَّاشِدِينَ المّهْدِيِّينَ عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الأُمُورِ فإنَّ كلّ مُحدثةٍ بدعة، وكُلَّ بِدْعَةٍ ضَلالَةٌ)",
        "textFr": "Le Messager d’Allah (ﷺ) nous adressa un sermon si émouvant que les cœurs en tremblèrent et que les larmes coulèrent des yeux. Nous dîmes : \"Ô Messager d’Allah ! Il semble que ce soit un sermon d’adieu, recommande-nous quelque chose.\" Il dit : \"Je vous recommande la crainte d’Allah, l’écoute et l’obéissance, même si un esclave est placé à votre tête. En effet, celui d’entre vous qui vivra verra de nombreuses divergences. Suivez donc ma Sunna et la Sunna des califes bien guidés après moi. Mordez-y à pleines dents ! Prenez garde aux innovations, car toute innovation est une hérésie, et toute hérésie est un égarement.\"",
        "textEn": "The Messenger of Allah (ﷺ) gave us a sermon that made our hearts tremble and our eyes shed tears. We said: \"O Messenger of Allah! It is as if this is a farewell sermon, so advise us.\" He said: \"I enjoin you to fear Allah, to listen and obey, even if a slave is appointed over you. Indeed, those who live after me will see much disagreement. So, adhere to my Sunnah and the Sunnah of the rightly guided caliphs after me. Hold onto it with your molar teeth! Beware of newly invented matters, for every innovation is a bid'ah (heresy), and every bid'ah is misguidance.\"",
        "explanationAr": "يدعو الحديث إلى التمسك بسنة النبي ﷺ وسنة الخلفاء الراشدين بعده، والتحذير من الابتداع في الدين. كما يؤكد على طاعة ولي الأمر ما دام في طاعة الله.",
        "explanationFr": "Ce hadith exhorte à suivre la Sunna du Prophète ﷺ et celle des califes bien guidés après lui, tout en mettant en garde contre les innovations religieuses. Il insiste également sur l'obéissance au dirigeant tant qu'il est dans l'obéissance à Allah.",
        "explanationEn": "This hadith emphasizes adhering to the Sunnah of the Prophet ﷺ and the rightly guided caliphs while warning against religious innovations. It also stresses obedience to leadership as long as it aligns with obedience to Allah.",
        "sourceAr": "رواه أبو داود والترمذي وقال: حديث حسن صحيح",
        "sourceFr": "Rapporté par Abu Dawud et At-Tirmidhi qui l'a déclaré authentique et bon",
        "sourceEn": "Reported by Abu Dawud and At-Tirmidhi, who classified it as sound and authentic"
      },      
      {
        "id": 29,
        "titleAr": "التزام أوامر الله",
        "titleFr": "L'observance des commandements d'Allah",
        "titleEn": "Adhering to Allah’s Commands",
        "narratorAr": "عن معاذ بن جبل رضي الله عنه قال: قلت يا رسول الله، أخبرني بعمل يدخلني الجنة ويباعدني عن النار، قال",
        "narratorFr": "D'après Mu'adh Ibn Jabal (qu'Allah l'agrée), j'ai dit : 'Ô Messager d'Allah, informe-moi d'une action qui me fera entrer au Paradis et m'éloignera de l'Enfer.' Il répondit",
        "narratorEn": "Narrated by Mu'adh Ibn Jabal (may Allah be pleased with him), I said: 'O Messenger of Allah, tell me of an action that will admit me into Paradise and keep me away from Hellfire.' He said",
        "textAr": "لَقَدْ سَأَلْتَ عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ تَعَالَى عَلَيْهِ: تَعْبُدُ اللَّهَ وَلَا تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ البَيْتَ، ثُمَّ قَالَ: أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْرِ؟ الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ، وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ، ثُمَّ تَلَا: (تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ) حَتَّى بَلَغَ (يَعْمَلُونَ). ثُمَّ قَالَ: أَلَا أُخْبِرُكَ بِرَأْسِ الأَمْرِ وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ؟ رَأْسُ الأَمْرِ الإِسْلَامُ، وَعَمُودُهُ الصَّلَاةُ، وَذِرْوَةُ سَنَامِهِ الْجِهَادُ. ثُمَّ قَالَ: أَلَا أُخْبِرُكَ بِمَلَاكِ ذَلِكَ كُلِّهِ؟ فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْكَ هَذَا، قُلْتُ: يَا نَبِيَّ اللَّهِ، وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟ فَقَالَ: ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ، وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ - أَوْ قَالَ: عَلَى مَنَاخِرِهِمْ - إِلَّا حَصَائِدُ أَلْسِنَتِهِمْ؟",
        "textFr": "Tu m’as interrogé sur une chose énorme, mais elle est facile pour celui à qui Allah la rend facile : adore Allah sans rien Lui associer, accomplis la prière, verse la zakat, jeûne le Ramadan et accomplis le pèlerinage à la Maison (Kaaba). Puis il dit : 'Ne t'indiquerai-je pas les portes du bien ? Le jeûne est une protection, l’aumône éteint les péchés comme l’eau éteint le feu, et la prière de l’homme en pleine nuit.' Puis il récita : '(Ils s'arrachent à leurs lits pour invoquer leur Seigneur... jusqu'à leur œuvre.)' Ensuite, il dit : 'Ne t’indiquerai-je pas la tête de l'affaire, son pilier et son sommet ? La tête de l'affaire est l'Islam, son pilier est la prière et son sommet est le djihad.' Puis il dit : 'Ne t’indiquerai-je pas ce qui permet de contrôler tout cela ?' Il saisit alors sa langue et dit : 'Retiens ceci !' J’ai dit : 'Ô Prophète d’Allah, serons-nous jugés pour ce que nous disons ?' Il répondit : 'Que ta mère te perde, ô Mu'adh ! Les gens ne sont-ils pas précipités en Enfer sur leurs visages – ou sur leurs nez – pour ce qu’ils ont récolté avec leurs langues ?'",
        "textEn": "You have asked about a great matter, yet it is easy for one to whom Allah makes it easy: Worship Allah without associating anything with Him, establish the prayer, pay the zakat, fast in Ramadan, and perform pilgrimage to the House (Kaaba). Then he said: 'Shall I not tell you the doors of goodness? Fasting is a shield, charity extinguishes sin as water extinguishes fire, and a man’s prayer in the middle of the night.' Then he recited: '(Their sides forsake their beds to invoke their Lord… until their deeds.)' Then he said: 'Shall I not tell you the head of the matter, its pillar, and its peak?' 'The head of the matter is Islam, its pillar is prayer, and its peak is jihad.' Then he said: 'Shall I not tell you what controls all of that?' He took hold of his tongue and said: 'Restrain this!' I said: 'O Prophet of Allah, will we be held accountable for what we say?' He replied: 'May your mother be bereaved of you, O Mu'adh! Are people thrown into Hell on their faces – or on their noses – for anything other than the harvest of their tongues?'",
        "explanationAr": "يؤكد الحديث على أركان الإسلام كمدخل إلى الجنة، ثم يوسع دائرة الأعمال الصالحة بذكر الصيام والصدقة وقيام الليل، ويبين أن أساس الدين هو الإسلام، وأهم أعمدته الصلاة، وأن أعلى مراتب الإيمان الجهاد. ثم يوضح أهمية ضبط اللسان، حيث يعتبر من أخطر ما يؤدي بالإنسان إلى النار.",
        "explanationFr": "Ce hadith met en avant les piliers de l'Islam comme clé du Paradis, puis élargit les actes pieux en mentionnant le jeûne, l’aumône et la prière nocturne. Il montre que l’Islam est la base de la religion, la prière son pilier et le djihad son sommet. Enfin, il insiste sur l'importance de contrôler sa langue, qui est souvent la cause de la perdition en Enfer.",
        "explanationEn": "This hadith emphasizes the pillars of Islam as the key to Paradise, then expands righteous deeds by mentioning fasting, charity, and night prayer. It shows that Islam is the foundation of religion, prayer is its pillar, and jihad is its peak. Finally, it stresses the importance of controlling one's tongue, which is often the cause of one's downfall into Hell.",
        "sourceAr": "رواه الترمذي وقال حديث حسن صحيح",
        "sourceFr": "Rapporté par At-Tirmidhi qui l'a qualifié de bon et authentique",
        "sourceEn": "Reported by At-Tirmidhi, who graded it as good and authentic"
      },
      {
        "id": 30,
        "titleAr": "الالتزام بالفرائض واجتناب المحرمات",
        "titleFr": "L'Engagement envers les Obligations et l'Évitement des Interdits",
        "titleEn": "Commitment to Obligations and Avoidance of Prohibitions",
        "narratorAr": "عن أبي ثعلبة الخشني جرثوم بن ناشر رضي الله عنه عن رسول الله ﷺ قال",
        "narratorFr": "D'après Abu Tha'laba al-Khushani Jurthum ibn Nashir (qu'Allah l'agrée), le Messager d’Allah ﷺ a dit",
        "narratorEn": "Narrated by Abu Tha'laba al-Khushani Jurthum ibn Nashir (may Allah be pleased with him), the Messenger of Allah ﷺ said",
        "textAr": "إِنَّ اللهَ فَرَضَ فَرَائِضَ فَلا تُضَيِّعُوهَا، وَحَدَّ حُدُودَاً فَلا تَعْتَدُوهَا وَحَرَّمَ أَشْيَاءَ فَلا تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلا تَبْحَثُوا عَنْهَا",
        "textFr": "Allah a prescrit des obligations, ne les négligez donc pas. Il a établi des limites, ne les transgressez donc pas. Il a interdit certaines choses, ne les enfreignez donc pas. Et Il s'est tu sur certaines choses par miséricorde envers vous et non par oubli, ne cherchez donc pas à les connaître.",
        "textEn": "Allah has ordained obligations, so do not neglect them. He has set limits, so do not transgress them. He has forbidden certain things, so do not violate them. And He has remained silent on some matters out of mercy for you, not out of forgetfulness, so do not seek them out.",
        "explanationAr": "يحث الحديث على الالتزام بالفرائض والحدود التي شرعها الله، واجتناب المحرمات، كما يوضح أن هناك أموراً سكت عنها الله رحمة بعباده وليس نسياناً، فلا ينبغي البحث عنها والتكلف فيها.",
        "explanationFr": "Ce hadith encourage à respecter les obligations et les limites fixées par Allah, tout en évitant les interdits. Il souligne également que certaines choses ont été laissées dans le silence par miséricorde et non par oubli, et qu'il ne faut pas chercher à en savoir davantage inutilement.",
        "explanationEn": "This hadith encourages adhering to the obligations and boundaries set by Allah while avoiding prohibitions. It also clarifies that some matters have been left unaddressed as a mercy, not out of forgetfulness, and should not be sought out unnecessarily.",
        "sourceAr": "حديث حسن رواه الدارقطني وغيره",
        "sourceFr": "Hadith jugé bon rapporté par Ad-Daraqutni et d'autres",
        "sourceEn": "A hasan (good) hadith reported by Ad-Daraqutni and others"
      },      
      {
        "id": 31,
        "titleAr": "الزهد في الدنيا",
        "titleFr": "Le renoncement aux biens de ce monde",
        "titleEn": "Detachment from the Worldly Life",
        "narratorAr": "عن أبي العباس سهل بن سعد الساعدي رضي الله عنه قال: جاء رجل إلى النبي صلى الله عليه وسلم فقال",
        "narratorFr": "D’après Abou Al-‘Abbas Sahl Ibn Sa’d As-Sa’idi (qu’Allah l’agrée), un homme vint voir le Prophète (ﷺ) et lui dit",
        "narratorEn": "Narrated by Abu Al-‘Abbas Sahl Ibn Sa’d As-Sa’idi (may Allah be pleased with him), a man came to the Prophet (ﷺ) and said",
        "textAr": "يَا رَسُولَ اللَّهِ، دُلَّنِي عَلَى عَمَلٍ إِذَا عَمِلْتُهُ أَحَبَّنِي اللَّهُ وَأَحَبَّنِي النَّاسُ؟ فَقَالَ: ازْهَدْ فِي الدُّنْيَا يُحِبَّكَ اللَّهُ، وَازْهَدْ فِيمَا فِي أَيْدِي النَّاسِ يُحِبُّوكَ",
        "textFr": "Ô Messager d’Allah, indique-moi un acte qui, si je le fais, me fera aimer d’Allah et des gens ? Il répondit : Détache-toi de ce bas-monde, Allah t’aimera. Détache-toi de ce qui est entre les mains des gens, et ils t’aimeront.",
        "textEn": "O Messenger of Allah, guide me to an act that, if I do it, will make Allah and the people love me. He replied: Detach yourself from this world, and Allah will love you. Detach yourself from what is in the hands of people, and they will love you.",
        "explanationAr": "يبين الحديث أهمية الزهد في الدنيا، وأنه طريق لمحبة الله ومحبة الناس. فالتعلق بالدنيا يُبعد الإنسان عن الله، بينما الزهد فيها يجعل الإنسان قريبًا من الله والناس، حيث لا يكون عبئًا على الآخرين ولا ينافسهم في متاع الدنيا.",
        "explanationFr": "Ce hadith met en avant l'importance du renoncement aux biens de ce monde. Celui qui s’attache trop à la vie terrestre s’éloigne d’Allah, alors que celui qui s’en détache devient aimé d’Allah et des gens, car il ne leur cause pas de tort en convoitant ce qu’ils possèdent.",
        "explanationEn": "This hadith highlights the importance of detachment from worldly possessions. Clinging too much to the world distances a person from Allah, while renouncing it brings Allah’s love and the love of people, as he does not burden or compete with them for material things.",
        "sourceAr": "رواه ابن ماجه وغيره بسند حسن",
        "sourceFr": "Rapporté par Ibn Majah et d'autres avec une chaîne de transmission considérée comme bonne",
        "sourceEn": "Reported by Ibn Majah and others with a reliable chain of narration"
      },
      {
        "id": 32,
        "titleAr": "لا ضرر ولا ضرار",
        "titleFr": "Pas de préjudice ni de nuisance",
        "titleEn": "No Harm and No Recompensing Harm",
        "narratorAr": "عن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال",
        "narratorFr": "D’après Abou Sa’id Al-Khoudri (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Sa’id Al-Khudri (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "لاَ ضَرَرَ وَلاَ ضِرَارَ",
        "textFr": "Il n’y a pas de préjudice ni de nuisance.",
        "textEn": "There should be neither harm nor reciprocating harm.",
        "explanationAr": "هذا الحديث أصل من أصول الشريعة في حفظ الحقوق ورفع الظلم. ومعنى (لا ضرر) أي لا يجوز للإنسان أن يلحق الضرر بنفسه أو بغيره، ومعنى (ولا ضرار) أي لا يجوز مقابلة الضرر بضرر آخر. وهو قاعدة عظيمة في التشريع الإسلامي.",
        "explanationFr": "Ce hadith est un principe fondamental de la charia pour la préservation des droits et l’élimination de l’injustice. (Pas de préjudice) signifie qu’une personne ne doit pas causer du tort à elle-même ou aux autres. (Ni de nuisance) signifie qu’il ne faut pas répondre au mal par un autre mal. C’est une règle essentielle en droit islamique.",
        "explanationEn": "This hadith is a fundamental principle in Islamic law for preserving rights and preventing injustice. (No harm) means that one should not cause harm to oneself or others. (Nor reciprocating harm) means that harm should not be responded to with another harm. This is a major legal maxim in Islamic jurisprudence.",
        "sourceAr": "رواه ابن ماجه والدارقطني وغيرهما، وهو حديث حسن",
        "sourceFr": "Rapporté par Ibn Majah, Ad-Daraqutni et d'autres, et il est considéré comme bon",
        "sourceEn": "Reported by Ibn Majah, Ad-Daraqutni, and others, and it is considered a good hadith"
      },
      {
        "id": 33,
        "titleAr": "البينة على المدعي واليمين على من أنكر",
        "titleFr": "La preuve incombe au plaignant et le serment à celui qui nie",
        "titleEn": "The Proof Is Upon the Claimant, and the Oath Is Upon the Denier",
        "narratorAr": "عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال",
        "narratorFr": "D’après Ibn ‘Abbas (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Ibn Abbas (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ، لادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ، وَلَكِنِ الْبَيِّنَةُ عَلَى الْمُدَّعِي، وَالْيَمِينُ عَلَى مَنْ أَنْكَرَ",
        "textFr": "Si l’on donnait aux gens ce qu’ils réclament, certains hommes revendiqueraient les biens et le sang d’autres. Mais la preuve incombe au plaignant et le serment à celui qui nie.",
        "textEn": "If people were given what they claim, some men would demand the wealth and lives of others. But the proof is upon the claimant, and the oath is upon the one who denies.",
        "explanationAr": "يقرر هذا الحديث قاعدة عظيمة في القضاء، وهي أن المدعي عليه عبء إثبات دعواه بالبينة، أما المدعى عليه فإن أنكر فليس عليه إلا اليمين. وهذا لحفظ الحقوق ومنع الظلم والادعاءات الكاذبة.",
        "explanationFr": "Ce hadith établit une règle fondamentale en matière judiciaire : celui qui réclame un droit doit apporter une preuve, tandis que celui qui le nie n’a qu’à prêter serment. Cela vise à préserver les droits et empêcher les fausses accusations.",
        "explanationEn": "This hadith establishes an important judicial principle: the claimant must provide evidence for their claim, while the defendant only needs to swear an oath if they deny it. This prevents false accusations and ensures justice.",
        "sourceAr": "رواه البيهقي في السنن الكبرى بسند حسن",
        "sourceFr": "Rapporté par Al-Bayhaqi dans As-Sunan Al-Kubra avec une chaîne de transmission considérée comme bonne",
        "sourceEn": "Reported by Al-Bayhaqi in As-Sunan Al-Kubra with a reliable chain of narration"
      },
      {
        "id": 34,
        "titleAr": "تغيير المنكر",
        "titleFr": "Le changement du mal",
        "titleEn": "Changing the Evil",
        "narratorAr": "عن أبي سعيد الخدري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول",
        "narratorFr": "D’après Abou Sa’id Al-Khoudri (qu’Allah l’agrée), j’ai entendu le Messager d’Allah (ﷺ) dire",
        "narratorEn": "Narrated by Abu Sa’id Al-Khudri (may Allah be pleased with him), I heard the Messenger of Allah (ﷺ) say",
        "textAr": "مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ، وَذَلِكَ أَضْعَفُ الْإِيمَانِ",
        "textFr": "Celui d’entre vous qui voit un mal, qu’il le change de sa main ; s’il ne peut pas, alors par sa langue ; s’il ne peut pas, alors par son cœur, et cela est le degré le plus faible de la foi.",
        "textEn": "Whoever among you sees an evil, let him change it with his hand. If he is unable to do so, then with his tongue. If he is unable to do so, then with his heart, and that is the weakest of faith.",
        "explanationAr": "يبين الحديث درجات تغيير المنكر، بدءًا من التغيير باليد لمن يملك السلطة، ثم باللسان لمن يستطيع النصح والتوجيه، وأخيرًا بالقلب، وهو أضعف الإيمان، لمن لا يملك أي وسيلة أخرى. وهذا يدل على مسؤولية المسلم تجاه المجتمع.",
        "explanationFr": "Ce hadith explique les niveaux de changement du mal : d’abord par la main pour ceux qui en ont l’autorité, puis par la parole pour ceux qui peuvent conseiller, et enfin par le cœur, ce qui est le niveau le plus faible de la foi. Cela montre la responsabilité du musulman envers la société.",
        "explanationEn": "This hadith explains the levels of changing evil: first by hand for those who have authority, then by speech for those who can advise, and finally by the heart, which is the weakest level of faith. This highlights the Muslim's responsibility toward society.",
        "sourceAr": "رواه مسلم في صحيحه",
        "sourceFr": "Rapporté par Muslim dans son Sahih",
        "sourceEn": "Reported by Muslim in his Sahih"
      },
      {
        "id": 35,
        "titleAr": "الأخوَّة بين المسلمين",
        "titleFr": "La fraternité entre les musulmans",
        "titleEn": "Brotherhood Among Muslims",
        "narratorAr": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال",
        "narratorFr": "D’après Abou Hourayra (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Abu Huraira (may Allah be pleased with him), the Messenger of Allah (ﷺ) said",
        "textAr": "لَا تَحَاسَدُوا، وَلَا تَنَاجَشُوا، وَلَا تَبَاغَضُوا، وَلَا تَدَابَرُوا، وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا. الْمُسْلِمُ أَخُو الْمُسْلِمِ، لَا يَظْلِمُهُ، وَلَا يَخْذُلُهُ، وَلَا يَكْذِبُهُ، وَلَا يَحْقِرُهُ. التَّقْوَى هَا هُنَا - وَيُشِيرُ إِلَى صَدْرِهِ ثَلَاثَ مَرَّاتٍ - بِحَسْبِ امْرِئٍ مِنَ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ. كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ: دَمُهُ وَمَالُهُ وَعِرْضُهُ",
        "textFr": "Ne soyez pas jaloux les uns des autres, ne gonflez pas artificiellement les prix, ne vous détestez pas, ne vous détournez pas les uns des autres et ne vendez pas sur la vente d’un autre. Soyez, ô serviteurs d’Allah, des frères ! Le musulman est le frère du musulman : il ne lui fait pas d’injustice, ne l’abandonne pas, ne lui ment pas et ne le méprise pas. La piété est ici – et il désigna sa poitrine trois fois. Il suffit d’un mal pour quelqu’un de mépriser son frère musulman. Tout le musulman est sacré pour un autre musulman : son sang, ses biens et son honneur.",
        "textEn": "Do not envy one another, do not artificially inflate prices, do not hate one another, do not turn away from one another, and do not undercut one another in trade. Be, O servants of Allah, brothers! A Muslim is the brother of another Muslim: he does not oppress him, nor does he abandon him, nor does he lie to him, nor does he belittle him. Piety is here – and he pointed to his chest three times. It is enough evil for a person to belittle his Muslim brother. Every Muslim's blood, wealth, and honor are sacred to another Muslim.",
        "explanationAr": "يرشد الحديث إلى أهمية الأخوة بين المسلمين، والنهي عن الحسد والتدابر والظلم والاحتقار. كما يؤكد على حرمة دم المسلم وماله وعرضه. ويبين أن التقوى محلها القلب، وهي أساس التعامل بين المسلمين.",
        "explanationFr": "Ce hadith enseigne l’importance de la fraternité entre les musulmans et interdit la jalousie, l’injustice, le mépris et les conflits. Il souligne aussi la sacralité du sang, des biens et de l’honneur du musulman. Enfin, il rappelle que la piété est dans le cœur et qu’elle guide les relations entre les croyants.",
        "explanationEn": "This hadith emphasizes the importance of brotherhood among Muslims and prohibits jealousy, injustice, contempt, and conflicts. It also highlights the sanctity of a Muslim’s blood, wealth, and honor. Finally, it reminds us that piety is in the heart and is the foundation of interactions among believers.",
        "sourceAr": "رواه مسلم في صحيحه",
        "sourceFr": "Rapporté par Muslim dans son Sahih",
        "sourceEn": "Reported by Muslim in his Sahih"
      },
      {
        "id": 36,
        "titleAr": "تفريج الكرب ومساعدة المسلمين",
        "titleFr": "Soulager les détresses et aider les musulmans",
        "titleEn": "Relieving Distress and Helping Muslims",
        "narratorAr": "عن أبي هريرة رضي الله عنه عن النبي ﷺ قال",
        "narratorFr": "D'après Abu Hurayra (qu'Allah l'agrée), le Prophète ﷺ a dit",
        "narratorEn": "Narrated by Abu Hurayra (may Allah be pleased with him), the Prophet ﷺ said",
        "textAr": "مَنْ نَفَّسَ عَنْ مُؤمِن كُربَةً مِن كُرَبِ الدُّنيَا نَفَّسَ اللهُ عَنهُ كُربَةً مِنْ كرَبِ يَومِ القيامَةِ، وَمَنْ يَسَّرَ على مُعسرٍ يَسَّرَ الله عَلَيهِ في الدُّنيَا والآخِرَة، وَمَنْ سَتَرَ مُسلِمَاً سَتَرَهُ الله في الدُّنيَا وَالآخِرَة، وَاللهُ في عَونِ العَبدِ مَا كَانَ العَبدُ في عَونِ أخيهِ، وَمَنْ سَلَكَ طَريقَاً يَلتَمِسُ فيهِ عِلمَاً سَهَّلَ اللهُ لهُ بِهِ طَريقَاً إِلَى الجَنَّةِ، وَمَا اجتَمَعَ قَومٌ في بَيتٍ مِنْ بيوتِ اللهِ يَتلونَ كِتابَ اللهِ وَيتَدارَسونهَ بَينَهُم إِلا نَزَلَت عَلَيهُم السَّكينَة وَغَشيَتهم الرَّحمَة وحَفَتهُمُ المَلائِكة وَذَكَرهُم اللهُ فيمَن عِندَهُ، وَمَنْ بَطَّأ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بهِ نَسَبُهُ",
        "textFr": "Celui qui soulage un croyant d'une détresse parmi les détresses de ce monde, Allah le soulagera d'une détresse parmi les détresses du Jour du Jugement. Celui qui facilite à un endetté, Allah lui facilitera dans ce monde et dans l'Au-delà. Celui qui couvre la faute d’un musulman, Allah le couvrira dans ce monde et dans l'Au-delà. Allah aide Son serviteur tant que ce dernier aide son frère. Celui qui emprunte un chemin en quête de savoir, Allah lui facilite un chemin vers le Paradis. Lorsqu'un groupe de personnes se réunit dans l'une des maisons d'Allah pour réciter et étudier ensemble le Livre d'Allah, la sérénité descend sur eux, la miséricorde les enveloppe, les anges les entourent et Allah les mentionne auprès de ceux qui sont auprès de Lui. Et celui dont les œuvres sont lentes, son lignage ne l’accélérera pas.",
        "textEn": "Whoever relieves a believer of distress in this world, Allah will relieve him of distress on the Day of Judgment. Whoever eases the hardship of a debtor, Allah will ease his hardship in this world and the Hereafter. Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and the Hereafter. Allah helps His servant as long as the servant helps his brother. Whoever follows a path in pursuit of knowledge, Allah will make his path to Paradise easy. When a group of people gathers in one of the houses of Allah to recite and study His Book together, tranquility descends upon them, mercy envelops them, angels surround them, and Allah mentions them among those who are with Him. And whoever is held back by his deeds, his lineage will not hasten him forward.",
        "explanationAr": "يشجع الحديث على تفريج الكروب ومساعدة المحتاجين، ويبين فضل السعي في طلب العلم والتجمع في بيوت الله لمدارسة القرآن، مع التأكيد على أن النسب لا يغني عن العمل الصالح.",
        "explanationFr": "Ce hadith encourage à soulager les détresses, aider les nécessiteux, chercher la connaissance, et se réunir pour étudier le Coran. Il rappelle également que la noblesse de l’ascendance ne remplace pas les bonnes actions.",
        "explanationEn": "This hadith emphasizes relieving distress, helping the needy, seeking knowledge, and gathering to study the Quran. It also reminds that lineage does not compensate for righteous deeds.",
        "sourceAr": "رواه مسلم بهذا اللفظ",
        "sourceFr": "Rapporté par Muslim avec ce texte",
        "sourceEn": "Reported by Muslim with this wording"
      },      
      {
        "id": 37,
        "titleAr": "فضل الصبر",
        "titleFr": "Le mérite de la patience",
        "titleEn": "The Virtue of Patience",
        "narratorAr": "عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال",
        "narratorFr": "D’après Ibn Abbas (qu’Allah les agrée tous deux), le Messager d’Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Ibn Abbas (may Allah be pleased with them both), the Messenger of Allah (ﷺ) said",
        "textAr": "إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ: فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ عَمِلَهَا كَتَبَهَا اللَّهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمِائَةِ ضِعْفٍ، إِلَى أَضْعَافٍ كَثِيرَةٍ، وَمَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ عَمِلَهَا كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً",
        "textFr": "Allah a inscrit les bonnes et les mauvaises actions, puis Il a expliqué cela : Celui qui a l’intention de faire une bonne action sans la réaliser, Allah la lui inscrit comme une bonne action complète. S’il la réalise, Allah la lui inscrit comme dix bonnes actions jusqu’à sept cents fois plus, voire bien davantage. Celui qui a l’intention de faire une mauvaise action sans la réaliser, Allah la lui inscrit comme une bonne action complète. S’il la réalise, Allah la lui inscrit comme une seule mauvaise action.",
        "textEn": "Allah has recorded good and evil deeds, then He explained that: Whoever intends to do a good deed but does not do it, Allah records it for him as a complete good deed. If he does it, Allah records it as ten good deeds, up to seven hundred times or even more. Whoever intends to do an evil deed but does not do it, Allah records it as a complete good deed. If he does it, Allah records it as one evil deed.",
        "explanationAr": "يوضح الحديث كرم الله وعدله في الحساب، حيث يضاعف الحسنات ولا يضاعف السيئات، بل يسجل الحسنة بمجرد النية، والسيئة لا تُكتب إلا إذا فُعلت. وهذا يدل على رحمة الله الواسعة بعباده.",
        "explanationFr": "Ce hadith met en évidence la générosité et la justice d’Allah dans la rétribution des actions. Il multiplie les récompenses des bonnes actions, tandis que les mauvaises actions ne sont comptées qu’une seule fois si elles sont accomplies. Cela montre l’immense miséricorde d’Allah envers Ses serviteurs.",
        "explanationEn": "This hadith highlights Allah’s generosity and justice in recording deeds. He multiplies the rewards of good deeds, whereas evil deeds are recorded only once if committed. This demonstrates Allah’s vast mercy toward His servants.",
        "sourceAr": "رواه البخاري ومسلم في صحيحيهما",
        "sourceFr": "Rapporté par Al-Bukhari et Muslim dans leurs Sahih",
        "sourceEn": "Reported by Al-Bukhari and Muslim in their Sahih collections"
      },
      {
        "id": 38,
        "titleAr": "ولاية الله لأوليائه",
        "titleFr": "La protection d'Allah pour Ses alliés",
        "titleEn": "Allah’s Protection for His Allies",
        "narratorAr": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم فيما يرويه عن ربه",
        "narratorFr": "D’après Abou Hourayra (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit, rapportant une parole de son Seigneur",
        "narratorEn": "Narrated by Abu Huraira (may Allah be pleased with him), the Messenger of Allah (ﷺ) said, reporting from his Lord",
        "textAr": "إِنَّ اللَّهَ قَالَ: مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ، كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَإِنْ سَأَلَنِي لَأُعْطِيَنَّهُ، وَلَئِنِ اسْتَعَاذَنِي لَأُعِيذَنَّهُ.",
        "textFr": "Allah a dit : Quiconque prend pour ennemi un de Mes alliés, Je lui déclare la guerre. Mon serviteur ne se rapproche pas de Moi par une chose qui Me soit plus aimée que ce que Je lui ai prescrit. Et Mon serviteur ne cesse de se rapprocher de Moi par les actes surérogatoires jusqu'à ce que Je l’aime. Et lorsqu’enfin Je l’aime, Je deviens son ouïe avec laquelle il entend, sa vue avec laquelle il voit, sa main avec laquelle il saisit, et son pied avec lequel il marche. S'il Me demande, Je lui accorderai, et s'il cherche refuge auprès de Moi, Je lui accorderai refuge.",
        "textEn": "Allah said: Whoever shows enmity to a friend of Mine, I have declared war against him. My servant does not draw near to Me with anything more beloved to Me than what I have made obligatory upon him. And My servant continues to draw near to Me with voluntary acts until I love him. When I love him, I become his hearing with which he hears, his sight with which he sees, his hand with which he grasps, and his foot with which he walks. If he asks Me, I will surely grant him, and if he seeks refuge in Me, I will surely give him refuge.",
        "explanationAr": "يبين الحديث منزلة أولياء الله وكرامتهم عنده، وأن الله يدافع عنهم ويتولاهم بحفظه، وأن القرب من الله يكون بأداء الفرائض أولًا، ثم الإكثار من النوافل حتى ينال العبد محبة الله، فيكون في معية الله وتوفيقه.",
        "explanationFr": "Ce hadith met en lumière la haute station des alliés d’Allah et Sa protection pour eux. Il enseigne que la meilleure manière de se rapprocher d’Allah est d’accomplir les obligations religieuses, puis d'ajouter les actes surérogatoires, ce qui mène à l’amour et au soutien d’Allah.",
        "explanationEn": "This hadith highlights the status of Allah’s allies and His protection over them. It teaches that the best way to draw close to Allah is by fulfilling the obligatory acts, followed by voluntary deeds, leading to Allah’s love and divine support.",
        "sourceAr": "رواه البخاري في صحيحه",
        "sourceFr": "Rapporté par Al-Bukhari dans son Sahih",
        "sourceEn": "Reported by Al-Bukhari in his Sahih"
      },
      {
        "id": 39,
        "titleAr": "تجاوز الله عن الخطأ والنسيان",
        "titleFr": "Allah pardonne l’erreur et l’oubli",
        "titleEn": "Allah Pardons Mistakes and Forgetfulness",
        "narratorAr": "عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال",
        "narratorFr": "D’après Ibn Abbas (qu’Allah les agrée tous deux), le Messager d’Allah (ﷺ) a dit",
        "narratorEn": "Narrated by Ibn Abbas (may Allah be pleased with them both), the Messenger of Allah (ﷺ) said",
        "textAr": "إِنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ.",
        "textFr": "Allah a pardonné à ma communauté l'erreur, l'oubli et ce à quoi ils ont été contraints.",
        "textEn": "Allah has pardoned for my nation mistakes, forgetfulness, and what they are forced to do under coercion.",
        "explanationAr": "يبين الحديث رحمة الله بعباده حيث يعفو عنهم إذا وقعوا في الخطأ أو النسيان أو إذا أجبروا على فعل شيء بغير إرادتهم. وهذا يثبت قاعدة رفع الحرج في الإسلام.",
        "explanationFr": "Ce hadith met en évidence la miséricorde d'Allah envers Ses serviteurs, car Il leur pardonne leurs erreurs, leurs oublis et les actes accomplis sous contrainte. Cela établit un principe de facilité en Islam.",
        "explanationEn": "This hadith highlights Allah’s mercy towards His servants, as He forgives them for their mistakes, forgetfulness, and actions committed under duress. This establishes a principle of ease in Islam.",
        "sourceAr": "رواه ابن ماجه والبيهقي، وهو حديث حسن",
        "sourceFr": "Rapporté par Ibn Majah et Al-Bayhaqi, et il est considéré comme un hadith hassan",
        "sourceEn": "Reported by Ibn Majah and Al-Bayhaqi, and it is classified as a Hasan hadith"
      },
      {
        "id": 40,
        "titleAr": "الدنيا دار ابتلاء",
        "titleFr": "Ce bas monde est une épreuve",
        "titleEn": "This World is a Test",
        "narratorAr": "عن عبد الله بن عمر رضي الله عنهما قال: أخذ رسول الله صلى الله عليه وسلم بمنكبي فقال",
        "narratorFr": "D’après Abdallah Ibn Omar (qu’Allah les agrée tous deux), le Messager d’Allah (ﷺ) a pris mes épaules et a dit",
        "narratorEn": "Narrated by Abdullah Ibn Umar (may Allah be pleased with them both), the Messenger of Allah (ﷺ) took hold of my shoulders and said",
        "textAr": "كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ. وَكَانَ ابْنُ عُمَرَ يَقُولُ: إِذَا أَمْسَيْتَ فَلَا تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرِ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لِمَوْتِكَ.",
        "textFr": "Sois dans ce bas monde comme un étranger ou un voyageur de passage. Ibn Omar disait : Lorsque tu es le soir, n’attends pas le matin, et lorsque tu es le matin, n’attends pas le soir. Tire profit de ta santé avant ta maladie, et de ta vie avant ta mort.",
        "textEn": "Be in this world as if you were a stranger or a traveler passing through. Ibn Umar used to say: When evening comes, do not expect to live until morning; and when morning comes, do not expect to live until evening. Take advantage of your health before your illness and your life before your death.",
        "explanationAr": "يبين الحديث حال المسلم في الدنيا، وأنها ليست دار استقرار بل دار ابتلاء واختبار. فالمؤمن فيها كالغريب الذي لا يتشبث بها، أو كالمسافر الذي يستعد للرحيل في أي لحظة.",
        "explanationFr": "Ce hadith explique que le croyant doit considérer ce monde comme une étape temporaire et non un lieu de séjour permanent. Il doit être prêt à partir à tout moment, en se préparant pour l’au-delà.",
        "explanationEn": "This hadith illustrates that a believer should treat this world as a temporary station and not as a permanent home. He should always be prepared to depart at any moment, focusing on the Hereafter.",
        "sourceAr": "رواه البخاري في صحيحه",
        "sourceFr": "Rapporté par Al-Bukhari dans son Sahih",
        "sourceEn": "Reported by Al-Bukhari in his Sahih"
      },
      {
        "id": 41,
        "titleAr": "اتباع الهوى لما جاء به النبي ﷺ",
        "titleFr": "Suivre ses désirs en accord avec ce qu’a apporté le Prophète ﷺ",
        "titleEn": "Aligning One's Desires with What the Prophet ﷺ Brought",
        "narratorAr": "عن أبي محمد عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله ﷺ",
        "narratorFr": "D'après Abu Muhammad Abdallah ibn Amr ibn al-As (qu'Allah les agrée), le Messager d’Allah ﷺ a dit",
        "narratorEn": "Narrated by Abu Muhammad Abdullah ibn Amr ibn al-As (may Allah be pleased with them both), the Messenger of Allah ﷺ said",
        "textAr": "لاَ يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَواهُ تَبَعَاً لِمَا جِئْتُ بِهِ",
        "textFr": "Aucun de vous ne sera un véritable croyant tant que ses désirs ne seront pas en accord avec ce que j’ai apporté.",
        "textEn": "None of you truly believes until his desires follow what I have brought.",
        "explanationAr": "يبين الحديث أن الإيمان الحقيقي يقتضي موافقة الهوى لما جاء به النبي ﷺ من تعاليم الإسلام، فلا يكون المرء مؤمنًا كاملًا حتى يكون هواه مطابقًا للشرع.",
        "explanationFr": "Ce hadith montre que la véritable foi implique que nos désirs et nos choix soient conformes aux enseignements du Prophète ﷺ et de l’Islam.",
        "explanationEn": "This hadith emphasizes that true faith requires aligning one's desires with the teachings of the Prophet ﷺ and Islam.",
        "sourceAr": "حديث حسن صحيح",
        "sourceFr": "Hadith Hassan Sahih",
        "sourceEn": "A Hasan Sahih Hadith"
      },      
      {
        "id": 42,
        "titleAr": "سعة مغفرة الله",
        "titleFr": "L’immensité du pardon d’Allah",
        "titleEn": "The Vastness of Allah’s Forgiveness",
        "narratorAr": "عن أنس بن مالك رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول",
        "narratorFr": "D’après Anas Ibn Malik (qu’Allah l’agrée), j’ai entendu le Messager d’Allah (ﷺ) dire",
        "narratorEn": "Narrated by Anas Ibn Malik (may Allah be pleased with him), I heard the Messenger of Allah (ﷺ) say",
        "textAr": "قَالَ اللَّهُ تَعَالَى: يَا ابْنَ آدَمَ، إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلَا أُبَالِي. يَا ابْنَ آدَمَ، لَوْ بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ، ثُمَّ اسْتَغْفَرْتَنِي، غَفَرْتُ لَكَ. يَا ابْنَ آدَمَ، إِنَّكَ لَوْ أَتَيْتَنِي بِقُرَابِ الْأَرْضِ خَطَايَا، ثُمَّ لَقِيتَنِي لَا تُشْرِكُ بِي شَيْئًا، لَأَتَيْتُكَ بِقُرَابِهَا مَغْفِرَةً.",
        "textFr": "Allah, le Très-Haut, a dit : Ô fils d'Adam ! Tant que tu M'invoques et places ton espoir en Moi, Je te pardonnerai ce que tu as fait, sans Me soucier. Ô fils d'Adam ! Si tes péchés atteignaient les nuages du ciel, puis que tu Me demandais pardon, Je te pardonnerais. Ô fils d'Adam ! Si tu venais à Moi avec des péchés remplissant la terre, mais que tu ne M'associes rien, Je viendrais à toi avec autant de pardon.",
        "textEn": "Allah, the Most High, said: O son of Adam! As long as you call upon Me and have hope in Me, I will forgive you for what you have done, and I do not mind. O son of Adam! If your sins were to reach the clouds of the sky, and then you sought forgiveness from Me, I would forgive you. O son of Adam! If you were to come to Me with sins as great as the earth, but you did not associate anything with Me, I would bring you forgiveness as great as it.",
        "explanationAr": "يبين الحديث سعة رحمة الله ومغفرته لعباده، وأن التوبة الصادقة والاستغفار الصادق يمحوان الذنوب مهما عظمت، بشرط الإخلاص في العبادة وعدم الشرك بالله.",
        "explanationFr": "Ce hadith met en évidence l’immensité de la miséricorde et du pardon d’Allah. Il montre que tant qu’une personne se repent sincèrement et ne commet pas de polythéisme, Allah lui pardonne, peu importe la grandeur de ses péchés.",
        "explanationEn": "This hadith highlights the vastness of Allah’s mercy and forgiveness. It shows that as long as a person sincerely repents and does not commit polytheism, Allah will forgive them regardless of the magnitude of their sins.",
        "sourceAr": "رواه الترمذي وقال حديث حسن صحيح",
        "sourceFr": "Rapporté par At-Tirmidhi qui a dit que c'est un hadith hassan sahih",
        "sourceEn": "Reported by At-Tirmidhi, who said it is a Hasan Sahih hadith"
      }
  ]