[
    {
      "id": 1,
      "step": 1,
      "titleen": "Dua for Guidance",
      "titlear": "دعاء الهداية",
      "titlefr": "Invocation pour la guidance",
      "descriptionen": "Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.",
      "descriptionar": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ.",
      "descriptionfr": "Seigneur, ne laisse pas nos cœurs dévier après nous avoir guidés, et accorde-nous Ta miséricorde. C’est Toi le Grand Donateur.",
      "sourceen": "Surah Al-Imran, 3:8",
      "sourcear": "سورة آل عمران، 3:8",
      "sourcefr": "Sourate Al-Imran, 3:8"
    },
    {
      "id": 2,
      "step": 2,
      "titleen": "Dua for Forgiveness",
      "titlear": "دعاء المغفرة",
      "titlefr": "Invocation pour le pardon",
      "descriptionen": "Our Lord, we have believed, so forgive us our sins and protect us from the punishment of the Fire.",
      "descriptionar": "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ.",
      "descriptionfr": "Seigneur, nous avons cru, pardonne-nous donc nos péchés et protège-nous du châtiment du Feu.",
      "sourceen": "Surah Al-Imran, 3:16",
      "sourcear": "سورة آل عمران، 3:16",
      "sourcefr": "Sourate Al-Imran, 3:16"
    },
    {
      "id": 3,
      "step": 3,
      "titleen": "Dua for Good in This Life and the Hereafter",
      "titlear": "دعاء الخير في الدنيا والآخرة",
      "titlefr": "Invocation pour le bien dans cette vie et dans l'au-delà",
      "descriptionen": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.",
      "descriptionar": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.",
      "descriptionfr": "Seigneur, accorde-nous le bien dans cette vie et le bien dans l'au-delà, et protège-nous du châtiment du Feu.",
      "sourceen": "Surah Al-Baqarah, 2:201",
      "sourcear": "سورة البقرة، 2:201",
      "sourcefr": "Sourate Al-Baqarah, 2:201"
    },
    {
      "id": 4,
      "step": 4,
      "titleen": "Dua for Patience and Victory",
      "titlear": "دعاء الصبر والنصر",
      "titlefr": "Invocation pour la patience et la victoire",
      "descriptionen": "Our Lord, pour upon us patience and let us die as Muslims [in submission to You].",
      "descriptionar": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ.",
      "descriptionfr": "Seigneur, déverse sur nous la patience et fais-nous mourir soumis à Toi.",
      "sourceen": "Surah Al-A'raf, 7:126",
      "sourcear": "سورة الأعراف، 7:126",
      "sourcefr": "Sourate Al-A'raf, 7:126"
    },
    {
      "id": 5,
      "step": 5,
      "titleen": "Dua for Protection from Evil",
      "titlear": "دعاء الحماية من الشر",
      "titlefr": "Invocation pour la protection contre le mal",
      "descriptionen": "My Lord, I seek refuge in You from the incitements of the devils, and I seek refuge in You, my Lord, lest they be present with me.",
      "descriptionar": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ.",
      "descriptionfr": "Seigneur, je cherche refuge auprès de Toi contre les incitations des démons, et je cherche refuge auprès de Toi, Seigneur, pour qu'ils ne soient pas présents avec moi.",
      "sourceen": "Surah Al-Mu'minun, 23:97-98",
      "sourcear": "سورة المؤمنون، 23:97-98",
      "sourcefr": "Sourate Al-Mu'minun, 23:97-98"
    },
    {
      "id": 6,
      "step": 6,
      "titleen": "Dua for Knowledge and Wisdom",
      "titlear": "دعاء العلم والحكمة",
      "titlefr": "Invocation pour la connaissance et la sagesse",
      "descriptionen": "My Lord, increase me in knowledge.",
      "descriptionar": "رَبِّ زِدْنِي عِلْمًا.",
      "descriptionfr": "Seigneur, augmente-moi en connaissance.",
      "sourceen": "Surah Taha, 20:114",
      "sourcear": "سورة طه، 20:114",
      "sourcefr": "Sourate Taha, 20:114"
    },
    {
      "id": 7,
      "step": 7,
      "titleen": "Dua for Mercy and Forgiveness",
      "titlear": "دعاء الرحمة والمغفرة",
      "titlefr": "Invocation pour la miséricorde et le pardon",
      "descriptionen": "Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.",
      "descriptionar": "رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.",
      "descriptionfr": "Seigneur, ne nous tiens pas rigueur si nous oublions ou commettons une erreur. Seigneur, ne nous impose pas un fardeau comme celui que Tu as imposé à ceux qui nous ont précédés. Seigneur, ne nous charge pas de ce que nous ne pouvons supporter. Pardonne-nous, fais-nous miséricorde. Tu es notre Maître, donne-nous donc la victoire sur les mécréants.",
      "sourceen": "Surah Al-Baqarah, 2:286",
      "sourcear": "سورة البقرة، 2:286",
      "sourcefr": "Sourate Al-Baqarah, 2:286"
    },
    {
      "id": 8,
      "step": 8,
      "titleen": "Dua for Protection from Arrogance",
      "titlear": "دعاء الحماية من الكبر",
      "titlefr": "Invocation pour la protection contre l'orgueil",
      "descriptionen": "My Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, and accept my supplication.",
      "descriptionar": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ.",
      "descriptionfr": "Seigneur, fais de moi un accomplisseur de la prière, ainsi que de ma descendance. Seigneur, accepte mon invocation.",
      "sourceen": "Surah Ibrahim, 14:40",
      "sourcear": "سورة إبراهيم، 14:40",
      "sourcefr": "Sourate Ibrahim, 14:40"
    },
    {
      "id": 9,
      "step": 9,
      "titleen": "Dua for Gratitude",
      "titlear": "دعاء الشكر",
      "titlefr": "Invocation pour la gratitude",
      "descriptionen": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants.",
      "descriptionar": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ.",
      "descriptionfr": "Seigneur, inspire-moi de rendre grâce pour le bienfait dont Tu m’as comblé ainsi que mes parents, et de faire le bien que Tu agrées. Fais-moi entrer, par Ta miséricorde, parmi Tes serviteurs vertueux.",
      "sourceen": "Surah An-Naml, 27:19",
      "sourcear": "سورة النمل، 27:19",
      "sourcefr": "Sourate An-Naml, 27:19"
    },
    {
      "id": 10,
      "step": 10,
      "titleen": "Dua for Relief from Distress",
      "titlear": "دعاء الفرج من الكرب",
      "titlefr": "Invocation pour le soulagement de la détresse",
      "descriptionen": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.",
      "descriptionar": "لَا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ.",
      "descriptionfr": "Il n’y a de divinité que Toi, pureté à Toi ! J’ai été du nombre des injustes.",
      "sourceen": "Surah Al-Anbiya, 21:87",
      "sourcear": "سورة الأنبياء، 21:87",
      "sourcefr": "Sourate Al-Anbiya, 21:87"
    }
  ]