[
    {
      "id": 1,
      "step": 1,
      "titleen": "Taking a Bath (Ghusl)",
      "titlear": "الاغتسال",
      "titlefr": "Prendre un bain (Ghusl)",
      "descriptionen": "It is Sunnah to perform Ghusl on Friday before going to the mosque, even if not in a state of major impurity.",
      "descriptionar": "من السنّة الاغتسال يوم الجمعة قبل الذهاب إلى المسجد ولو لم يكن على جنابة.",
      "descriptionfr": "Il est recommandé de prendre un bain rituel (Ghusl) le vendredi avant de se rendre à la mosquée, même sans impureté majeure.",
      "sourceen": "Hadith: 'Ghusl on Friday is obligatory for every Muslim.' (Sahih al-Bukhari)",
      "sourcear": "الحديث: 'غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ.' (صحيح البخاري)",
      "sourcefr": "Hadith : 'Le bain du vendredi est obligatoire pour tout musulman pubère.' (Sahih al-Bukhari)"
    },
    {
      "id": 2,
      "step": 2,
      "titleen": "Wearing Clean Clothes",
      "titlear": "لبس الثياب النظيفة",
      "titlefr": "Porter des vêtements propres",
      "descriptionen": "Wear clean, preferably white clothes, and apply perfume (for men).",
      "descriptionar": "البس ثيابًا نظيفة (يفضل البيضاء) وتطيب (للرجال).",
      "descriptionfr": "Portez des vêtements propres (de préférence blancs) et parfumez-vous (pour les hommes).",
      "sourceen": "Hadith: 'Every Muslim should bathe on Friday and wear his best clothes.' (Sahih Muslim)",
      "sourcear": "الحديث: 'على كل مسلم أن يغتسل يوم الجمعة ويلبس من صالح ثيابه.' (صحيح مسلم)",
      "sourcefr": "Hadith : 'Tout musulman doit se laver le vendredi et porter ses meilleurs vêtements.' (Sahih Muslim)"
    },
    {
      "id": 3,
      "step": 3,
      "titleen": "Going Early to the Mosque",
      "titlear": "التبكير إلى المسجد",
      "titlefr": "Se rendre tôt à la mosquée",
      "descriptionen": "Go to the mosque as early as possible. The earlier one goes, the greater the reward.",
      "descriptionar": "اذهب إلى المسجد مبكرًا، فكلما بكرت زاد أجرك.",
      "descriptionfr": "Rendez-vous tôt à la mosquée. Plus vous arrivez tôt, plus la récompense est grande.",
      "sourceen": "Hadith: 'Whoever bathes on Friday, goes early to the mosque, and sits close to the Imam... his reward is like fasting a full year.' (Ibn Majah)",
      "sourcear": "الحديث: 'من اغتسل يوم الجمعة ثم بكر إلى المسجد... كان كفارته لذنوبه إلى الجمعة الأخرى.' (ابن ماجه)",
      "sourcefr": "Hadith : 'Celui qui se lave le vendredi, se rend tôt à la mosquée... aura une récompense équivalente à un jeûne d’un an.' (Ibn Majah)"
    },
    {
      "id": 4,
      "step": 4,
      "titleen": "Reciting Surah Al-Kahf",
      "titlear": "قراءة سورة الكهف",
      "titlefr": "Réciter la sourate Al-Kahf",
      "descriptionen": "Recite Surah Al-Kahf (Chapter 18) on Friday. It brings light and protection from trials.",
      "descriptionar": "اقرأ سورة الكهف يوم الجمعة، فهي نور ووقاية من الفتن.",
      "descriptionfr": "Récitez la sourate Al-Kahf (chapitre 18) le vendredi. Elle est une lumière et une protection contre les épreuves.",
      "sourceen": "Hadith: 'Whoever reads Surah Al-Kahf on Friday, a light will shine for him between the two Fridays.' (Al-Hakim)",
      "sourcear": "الحديث: 'من قرأ سورة الكهف يوم الجمعة أضاء له من النور ما بين الجمعتين.' (الحاكم)",
      "sourcefr": "Hadith : 'Celui qui lit la sourate Al-Kahf le vendredi, une lumière l’illuminera entre les deux vendredis.' (Al-Hakim)"
    },
    {
      "id": 5,
      "step": 5,
      "titleen": "Sending Blessings on the Prophet (ﷺ)",
      "titlear": "الصلاة على النبي (ﷺ)",
      "titlefr": "Invoquer les bénédictions sur le Prophète (ﷺ)",
      "descriptionen": "Send abundant blessings (Salawat) upon the Prophet Muhammad (ﷺ) throughout the day.",
      "descriptionar": "أكثر من الصلاة على النبي محمد (ﷺ) خلال يوم الجمعة.",
      "descriptionfr": "Multipliez les invocations de bénédictions (Salawat) sur le Prophète Muhammad (ﷺ) durant la journée.",
      "sourceen": "Hadith: 'Increase your blessings upon me on Fridays.' (Abu Dawood)",
      "sourcear": "الحديث: 'أكثروا من الصلاة عليّ يوم الجمعة.' (أبو داود)",
      "sourcefr": "Hadith : 'Multipliez les bénédictions sur moi le vendredi.' (Abu Dawood)"
    },
    {
      "id": 6,
      "step": 6,
      "titleen": "Listening to the Khutbah",
      "titlear": "الإنصات للخطبة",
      "titlefr": "Écouter le sermon (Khutbah)",
      "descriptionen": "Listen attentively to the Friday sermon (Khutbah) and avoid speaking during it.",
      "descriptionar": "أنصت للخطبة باهتمام وامتنع عن الكلام أثناءها.",
      "descriptionfr": "Écoutez attentivement le sermon (Khutbah) et évitez de parler pendant celui-ci.",
      "sourceen": "Hadith: 'If you tell your companion to be quiet during the Khutbah, you have spoken vainly.' (Sahih al-Bukhari)",
      "sourcear": "الحديث: 'إذا قلت لصاحبك: أنصت يوم الجمعة والإمام يخطب فقد لغوت.' (صحيح البخاري)",
      "sourcefr": "Hadith : 'Si tu dis à ton voisin de se taire pendant le sermon, tu as parlé en vain.' (Sahih al-Bukhari)"
    },
    {
      "id": 7,
      "step": 7,
      "titleen": "Praying Sunnah After Jumu'ah",
      "titlear": "صلاة السنة بعد الجمعة",
      "titlefr": "Prier les Sunnah après la prière du Vendredi",
      "descriptionen": "Pray 2 or 4 Rak'ahs after the Friday prayer. The Prophet (ﷺ) said: 'Whoever prays 4 Rak'ahs after Jumu'ah, Allah will grant him the reward of a martyr.' (Ibn Majah)",
      "descriptionar": "صلّ ركعتين أو أربعًا بعد صلاة الجمعة. قال النبي (ﷺ): 'من صلى أربعًا بعد الجمعة كُتب له أجر شهيد.' (ابن ماجه)",
      "descriptionfr": "Priez 2 ou 4 Rak'ahs après la prière du Vendredi. Le Prophète (ﷺ) a dit : 'Celui qui prie 4 Rak'ahs après la prière du Vendredi, Allah lui accordera la récompense d'un martyr.' (Ibn Majah)",
      "sourceen": "Hadith: 'Pray after Jumu'ah, 2 or 4 Rak'ahs.' (Sunan Abu Dawood)",
      "sourcear": "الحديث: 'صَلُّوا بعد الجمعة ركعتين أو أربعًا.' (سنن أبي داود)",
      "sourcefr": "Hadith : 'Priez après la prière du Vendredi, 2 ou 4 Rak'ahs.' (Sunan Abu Dawood)"
    },
    {
      "id": 8,
      "step": 8,
      "titleen": "Making Dua During the Last Hour",
      "titlear": "الدعاء في ساعة الإجابة",
      "titlefr": "Invoquer durant l'heure d'exaucement",
      "descriptionen": "There is a special hour on Friday when supplications are accepted. Seek it during the last moments before sunset.",
      "descriptionar": "هناك ساعة خاصة يوم الجمعة تُستجاب فيها الدعوات. التمسها آخر ساعة قبل غروب الشمس.",
      "descriptionfr": "Il existe une heure spécifique le vendredi où les invocations sont exaucées. Cherchez-la durant les derniers instants avant le coucher du soleil.",
      "sourceen": "Hadith: 'Friday has a moment when no Muslim servant asks Allah for something good except that He grants it.' (Sahih al-Bukhari)",
      "sourcear": "الحديث: 'في الجمعة ساعة لا يوافقها عبد مسلم يسأل الله خيرًا إلا أعطاه إياه.' (صحيح البخاري)",
      "sourcefr": "Hadith : 'Le vendredi a une heure où tout serviteur musulman qui demande un bien à Allah l’obtient.' (Sahih al-Bukhari)"
    }
  ]