[
    {
      "id": 1,
      "step": 1,
      "titleen": "Make the Intention (Niyyah)",
      "titlear": "النية",
      "titlefr": "Formuler l'intention (Niyyah)",
      "descriptionen": "Begin by making the intention in your heart to perform the specific prayer (e.g., Fajr, Dhuhr, Asr, Maghrib, or Isha). The intention does not need to be spoken aloud.",
      "descriptionar": "ابدأ بتكوين النية في قلبك لأداء الصلاة المحددة (مثل الفجر، الظهر، العصر، المغرب، أو العشاء). لا يلزم التلفظ بالنية بصوت عالٍ.",
      "descriptionfr": "Commencez par formuler l'intention dans votre cœur d'accomplir la prière spécifique (par exemple, Fajr, Dhuhr, Asr, Maghrib ou Isha). L'intention n'a pas besoin d'être exprimée à haute voix.",
      "sourceen": "Islamic teachings based on the Hadith: 'Actions are judged by intentions.' (Sahih al-Bukhari)",
      "sourcear": "تعاليم إسلامية بناء على الحديث: 'إنما الأعمال بالنيات.' (صحيح البخاري)",
      "sourcefr": "Enseignements islamiques basés sur le Hadith : 'Les actions ne valent que par leurs intentions.' (Sahih al-Bukhari)"
    },
    {
      "id": 2,
      "step": 2,
      "titleen": "Stand Facing the Qiblah",
      "titlear": "الوقوف باتجاه القبلة",
      "titlefr": "Se tenir debout face à la Qiblah",
      "descriptionen": "Stand upright facing the direction of the Kaaba in Mecca (Qiblah). Ensure your posture is calm and focused.",
      "descriptionar": "قف منتصبًا متجهًا نحو الكعبة في مكة (القبلة). تأكد من أن هيئتك هادئة ومركزة.",
      "descriptionfr": "Tenez-vous droit en direction de la Kaaba à La Mecque (Qiblah). Assurez-vous que votre posture est calme et concentrée.",
      "sourceen": "Quran: 'So turn your face toward al-Masjid al-Haram.' (Surah Al-Baqarah, 2:144)",
      "sourcear": "القرآن: 'فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ.' (سورة البقرة، 2:144)",
      "sourcefr": "Coran : 'Alors tourne ton visage vers la Mosquée Sacrée.' (Sourate Al-Baqarah, 2:144)"
    },
    {
      "id": 3,
      "step": 3,
      "titleen": "Raise Your Hands and Say Takbir (Takbiratul Ihram)",
      "titlear": "رفع اليدين والتكبير (تكبيرة الإحرام)",
      "titlefr": "Lever les mains et dire le Takbir (Takbiratul Ihram)",
      "descriptionen": "Raise your hands to your ears and say 'Allahu Akbar' (الله أكبر), which means 'Allah is the Greatest.' This marks the beginning of the prayer.",
      "descriptionar": "ارفع يديك إلى أذنيك وقل 'الله أكبر'، مما يعني 'الله أكبر'. هذا يعلن بداية الصلاة.",
      "descriptionfr": "Levez vos mains à vos oreilles et dites 'Allahu Akbar' (الله أكبر), ce qui signifie 'Allah est le Plus Grand.' Cela marque le début de la prière.",
      "sourceen": "Hadith: The Prophet (ﷺ) used to raise his hands to the level of his shoulders when he began the prayer. (Sahih al-Bukhari)",
      "sourcear": "الحديث: كان النبي (ﷺ) يرفع يديه إلى مستوى كتفيه عند بدء الصلاة. (صحيح البخاري)",
      "sourcefr": "Hadith : Le Prophète (ﷺ) levait ses mains à la hauteur de ses épaules lorsqu'il commençait la prière. (Sahih al-Bukhari)"
    },
    {
      "id": 4,
      "step": 4,
      "titleen": "Recite Surah Al-Fatihah",
      "titlear": "قراءة سورة الفاتحة",
      "titlefr": "Réciter la sourate Al-Fatihah",
      "descriptionen": "Recite Surah Al-Fatihah, the opening chapter of the Quran, followed by another Surah or a few verses from the Quran.",
      "descriptionar": "اقرأ سورة الفاتحة، الفاتحة الكتاب، تليها سورة أخرى أو بضع آيات من القرآن.",
      "descriptionfr": "Récitez la sourate Al-Fatihah, le chapitre d'ouverture du Coran, suivie d'une autre sourate ou de quelques versets du Coran.",
      "sourceen": "Hadith: 'There is no prayer for the one who does not recite the Opening of the Book (Al-Fatihah).' (Sahih al-Bukhari)",
      "sourcear": "الحديث: 'لا صلاة لمن لم يقرأ بفاتحة الكتاب.' (صحيح البخاري)",
      "sourcefr": "Hadith : 'Il n'y a pas de prière pour celui qui ne récite pas l'Ouverture du Livre (Al-Fatihah).' (Sahih al-Bukhari)"
    },
    {
      "id": 5,
      "step": 5,
      "titleen": "Bow Down (Ruku)",
      "titlear": "الركوع",
      "titlefr": "S'incliner (Ruku)",
      "descriptionen": "Bow down with your hands on your knees and say 'Subhana Rabbiyal Adheem' (سبحان ربي العظيم), which means 'Glory to my Lord, the Almighty.'",
      "descriptionar": "انحني واضعًا يديك على ركبتيك وقل 'سبحان ربي العظيم'، مما يعني 'سبحان ربي العظيم.'",
      "descriptionfr": "Inclinez-vous en plaçant vos mains sur vos genoux et dites 'Subhana Rabbiyal Adheem' (سبحان ربي العظيم), ce qui signifie 'Gloire à mon Seigneur, le Tout-Puissant.'",
      "sourceen": "Hadith: The Prophet (ﷺ) said, 'The closest a servant is to his Lord is while they are bowing.' (Sahih Muslim)",
      "sourcear": "الحديث: قال النبي (ﷺ): 'أقرب ما يكون العبد من ربه وهو راكع.' (صحيح مسلم)",
      "sourcefr": "Hadith : Le Prophète (ﷺ) a dit : 'Le plus proche qu'un serviteur est de son Seigneur, c'est lorsqu'il est en inclinaison.' (Sahih Muslim)"
    },
    {
      "id": 6,
      "step": 6,
      "titleen": "Stand Up from Ruku",
      "titlear": "القيام من الركوع",
      "titlefr": "Se relever de l'inclinaison (Ruku)",
      "descriptionen": "Stand up straight and say 'Sami Allahu liman hamidah' (سمع الله لمن حمده), which means 'Allah hears those who praise Him,' followed by 'Rabbana wa lakal hamd' (ربنا ولك الحمد), meaning 'Our Lord, to You is all praise.'",
      "descriptionar": "قف منتصبًا وقل 'سمع الله لمن حمده'، مما يعني 'سمع الله لمن حمده'، ثم قل 'ربنا ولك الحمد'، مما يعني 'ربنا ولك الحمد.'",
      "descriptionfr": "Levez-vous et dites 'Sami Allahu liman hamidah' (سمع الله لمن حمده), ce qui signifie 'Allah entend celui qui Le loue,' suivi de 'Rabbana wa lakal hamd' (ربنا ولك الحمد), signifiant 'Notre Seigneur, à Toi toute la louange.'",
      "sourceen": "Hadith: The Prophet (ﷺ) used to say this after rising from Ruku. (Sahih al-Bukhari)",
      "sourcear": "الحديث: كان النبي (ﷺ) يقول هذا بعد القيام من الركوع. (صحيح البخاري)",
      "sourcefr": "Hadith : Le Prophète (ﷺ) disait cela après s'être relevé de l'inclinaison. (Sahih al-Bukhari)"
    },
    {
      "id": 7,
      "step": 7,
      "titleen": "Prostrate (Sujood)",
      "titlear": "السجود",
      "titlefr": "Se prosterner (Sujood)",
      "descriptionen": "Go into prostration with your forehead, nose, palms, knees, and toes touching the ground. Say 'Subhana Rabbiyal A'la' (سبحان ربي الأعلى), which means 'Glory to my Lord, the Most High.'",
      "descriptionar": "اذهب إلى السجود مع لمس جبهتك وأنفك وكفيك وركبتيك وأصابع قدميك للأرض. قل 'سبحان ربي الأعلى'، مما يعني 'سبحان ربي الأعلى.'",
      "descriptionfr": "Prosternez-vous en touchant le sol avec votre front, votre nez, vos paumes, vos genoux et vos orteils. Dites 'Subhana Rabbiyal A'la' (سبحان ربي الأعلى), ce qui signifie 'Gloire à mon Seigneur, le Très-Haut.'",
      "sourceen": "Hadith: The Prophet (ﷺ) said, 'The closest a servant is to his Lord is while they are in prostration.' (Sahih Muslim)",
      "sourcear": "الحديث: قال النبي (ﷺ): 'أقرب ما يكون العبد من ربه وهو ساجد.' (صحيح مسلم)",
      "sourcefr": "Hadith : Le Prophète (ﷺ) a dit : 'Le plus proche qu'un serviteur est de son Seigneur, c'est lorsqu'il est en prosternation.' (Sahih Muslim)"
    },
    {
      "id": 8,
      "step": 8,
      "titleen": "Sit Between the Two Prostrations",
      "titlear": "الجلوس بين السجدتين",
      "titlefr": "S'asseoir entre les deux prosternations",
      "descriptionen": "Sit up straight and say 'Allahu Akbar,' then prostrate again as before. Between the two prostrations, say 'Rabbighfir li' (رب اغفر لي), which means 'O Lord, forgive me.'",
      "descriptionar": "اجلس منتصبًا وقل 'الله أكبر'، ثم اسجد مرة أخرى كما فعلت من قبل. بين السجدتين، قل 'رب اغفر لي'، مما يعني 'رب اغفر لي.'",
      "descriptionfr": "Asseyez-vous droit et dites 'Allahu Akbar,' puis prosternez-vous à nouveau comme avant. Entre les deux prosternations, dites 'Rabbighfir li' (رب اغفر لي), ce qui signifie 'Ô Seigneur, pardonne-moi.'",
      "sourceen": "Hadith: The Prophet (ﷺ) used to sit between the two prostrations and supplicate. (Sunan Abu Dawood)",
      "sourcear": "الحديث: كان النبي (ﷺ) يجلس بين السجدتين ويدعو. (سنن أبي داود)",
      "sourcefr": "Hadith : Le Prophète (ﷺ) s'asseyait entre les deux prosternations et invoquait. (Sunan Abu Dawood)"
    },
    {
      "id": 9,
      "step": 9,
      "titleen": "Final Sitting (Tashahhud)",
      "titlear": "الجلوس الأخير (التشهد)",
      "titlefr": "Assise finale (Tashahhud)",
      "descriptionen": "After completing the prostrations, sit and recite the Tashahhud: 'At-tahiyyatu lillahi was-salawatu wat-tayyibatu...' (التحيات لله والصلوات والطيبات).",
      "descriptionar": "بعد الانتهاء من السجدات، اجلس واقرأ التشهد: 'التحيات لله والصلوات والطيبات...'.",
      "descriptionfr": "Après avoir terminé les prosternations, asseyez-vous et récitez le Tashahhud : 'At-tahiyyatu lillahi was-salawatu wat-tayyibatu...' (التحيات لله والصلوات والطيبات).",
      "sourceen": "Hadith: The Prophet (ﷺ) taught this supplication to his companions. (Sahih al-Bukhari)",
      "sourcear": "الحديث: علم النبي (ﷺ) هذا الدعاء لأصحابه. (صحيح البخاري)",
      "sourcefr": "Hadith : Le Prophète (ﷺ) a enseigné cette invocation à ses compagnons. (Sahih al-Bukhari)"
    },
    {
      "id": 10,
      "step": 10,
      "titleen": "End with Salam",
      "titlear": "الختام بالتسليم",
      "titlefr": "Terminer par le Salam",
      "descriptionen": "Turn your head to the right and say 'Assalamu alaikum wa rahmatullah' (السلام عليكم ورحمة الله), then to the left and repeat the same. This concludes the prayer.",
      "descriptionar": "أدر رأسك إلى اليمين وقل 'السلام عليكم ورحمة الله'، ثم إلى اليسار وكرر نفس الشيء. هذا ينهي الصلاة.",
      "descriptionfr": "Tournez votre tête vers la droite et dites 'Assalamu alaikum wa rahmatullah' (السلام عليكم ورحمة الله), puis vers la gauche et répétez la même chose. Cela conclut la prière.",
      "sourceen": "Hadith: The Prophet (ﷺ) used to end his prayer by saying Salam to both sides. (Sahih al-Bukhari)",
      "sourcear": "الحديث: كان النبي (ﷺ) يختم صلاته بالتسليم على الجانبين. (صحيح البخاري)",
      "sourcefr": "Hadith : Le Prophète (ﷺ) terminait sa prière en disant Salam des deux côtés. (Sahih al-Bukhari)"
    }
  ]